{"Travel":[{"bookTitle":"It's Only the Himalayas","bookPrice":"£45.17","noAvailable":"19","imageUrl":"http://books.toscrape.com/media/cache/6d/41/6d418a73cc7d4ecfd75ca11d854041db.jpg","bookDescription":"“Wherever you go, whatever you do, just . . . don’t do anything stupid.” —My MotherDuring her yearlong adventure backpacking from South Africa to Singapore, S. Bedford definitely did a few things her mother might classify as \"stupid.\" She swam with great white sharks in South Africa, ran from lions in Zimbabwe, climbed a Himalayan mountain without training in Nepal, and wa “Wherever you go, whatever you do, just . . . don’t do anything stupid.” —My MotherDuring her yearlong adventure backpacking from South Africa to Singapore, S. Bedford definitely did a few things her mother might classify as \"stupid.\" She swam with great white sharks in South Africa, ran from lions in Zimbabwe, climbed a Himalayan mountain without training in Nepal, and watched as her friend was attacked by a monkey in Indonesia.But interspersed in those slightly more crazy moments, Sue Bedfored and her friend \"Sara the Stoic\" experienced the sights, sounds, life, and culture of fifteen countries. Joined along the way by a few friends and their aging fathers here and there, Sue and Sara experience the trip of a lifetime. They fall in love with the world, cultivate an appreciation for home, and discover who, or what, they want to become.It's Only the Himalayas is the incredibly funny, sometimes outlandish, always entertaining confession of a young backpacker that will inspire you to take your own adventure. ...more","upc":"a22124811bfa8350"},{"bookTitle":"Full Moon over Noah’s Ark: An Odyssey to Mount Ararat and Beyond","bookPrice":"£49.43","noAvailable":"15","imageUrl":"http://books.toscrape.com/media/cache/fe/8a/fe8af6ceec7718986380c0fde9b3b34f.jpg","bookDescription":"Acclaimed travel writer Rick Antonson sets his adventurous compass on Mount Ararat, exploring the region’s long history, religious mysteries, and complex politics.Mount Ararat is the most fabled mountain in the world. For millennia this massif in eastern Turkey has been rumored as the resting place of Noah’s Ark following the Great Flood. But it also plays a significant ro Acclaimed travel writer Rick Antonson sets his adventurous compass on Mount Ararat, exploring the region’s long history, religious mysteries, and complex politics.Mount Ararat is the most fabled mountain in the world. For millennia this massif in eastern Turkey has been rumored as the resting place of Noah’s Ark following the Great Flood. But it also plays a significant role in the longstanding conflict between Turkey and Armenia.Author Rick Antonson joined a five-member expedition to the mountain’s nearly 17,000-foot summit, trekking alongside a contingent of Armenians, for whom Mount Ararat is the stolen symbol of their country. Antonson weaves vivid historical anecdote with unexpected travel vignettes, whether tracing earlier mountaineering attempts on the peak, recounting the genocide of Armenians and its unresolved debate, or depicting the Kurds’ ambitions for their own nation’s borders, which some say should include Mount Ararat.What unfolds in Full Moon Over Noah’s Ark is one man’s odyssey, a tale told through many stories. Starting with the flooding of the Black Sea in 5600 BCE, through to the Epic of Gilgamesh and the contrasting narratives of the Great Flood known to followers of the Judaic, Christian and Islamic religions, Full Moon Over Noah’s Ark takes readers along with Antonson through the shadows and broad landscapes of Turkey, Iraq, Iran and Armenia, shedding light on a troubled but fascinating area of the world. ...more","upc":"ce60436f52c5ee68"},{"bookTitle":"See America: A Celebration of Our National Parks & Treasured Sites","bookPrice":"£48.87","noAvailable":"14","imageUrl":"http://books.toscrape.com/media/cache/c7/1a/c71a85dbf8c2dbc75cb271026618477c.jpg","bookDescription":"To coincide with the 2016 centennial anniversary of the National Parks Service, the Creative Action Network has partnered with the National Parks Conservation Association to revive and reimagine the legacy of WPA travel posters. Artists from all over the world have participated in the creation of this new, crowdsourced collection of See America posters for a modern era. Fe To coincide with the 2016 centennial anniversary of the National Parks Service, the Creative Action Network has partnered with the National Parks Conservation Association to revive and reimagine the legacy of WPA travel posters. Artists from all over the world have participated in the creation of this new, crowdsourced collection of See America posters for a modern era. Featuring artwork for 75 national parks and monuments across all 50 states, this engaging keepsake volume celebrates the full range of our nation's landmarks and treasured wilderness. ...more","upc":"f9705c362f070608"},{"bookTitle":"Vagabonding: An Uncommon Guide to the Art of Long-Term World Travel","bookPrice":"£36.94","noAvailable":"8","imageUrl":"http://books.toscrape.com/media/cache/ca/30/ca30b1afe1e76ce7ba1db8176d398e53.jpg","bookDescription":"With a new foreword by Tim Ferriss •There’s nothing like vagabonding: taking time off from your normal life—from six weeks to four months to two years—to discover and experience the world on your own terms. In this one-of-a-kind handbook, veteran travel writer Rolf Potts explains how anyone armed with an independent spirit can achieve the dream of extended overseas travel. With a new foreword by Tim Ferriss • There’s nothing like vagabonding: taking time off from your normal life—from six weeks to four months to two years—to discover and experience the world on your own terms. In this one-of-a-kind handbook, veteran travel writer Rolf Potts explains how anyone armed with an independent spirit can achieve the dream of extended overseas travel. Now completely revised and updated, Vagabonding is an accessible and inspiring guide to   • financing your travel time • determining your destination • adjusting to life on the road • working and volunteering overseas • handling travel adversity • re-assimilating back into ordinary life  Praise for Vagabonding  “A crucial reference for any budget wanderer.”—Time  “Vagabonding easily remains in my top-10 list of life-changing books. Why? Because one incredible trip, especially a long-term trip, can change your life forever. And Vagabonding teaches you how to travel (and think), not just for one trip, but for the rest of your life.”—Tim Ferriss, from the foreword   “The book is a meditation on the joys of hitting the road. . . . It’s also a primer for those with a case of pent-up wanderlust seeking to live the dream.”—USA Today   “I couldn’t put this book down. It’s a whole different ethic of travel. . . . [Potts’s] practical advice might just convince you to enjoy that open-ended trip of a lifetime.”—Rick Steves   “Potts wants us to wander, to explore, to embrace the unknown, and, finally, to take our own damn time about it. I think this is the most sensible book of travel-related advice ever written.”—Tim Cahill, founding editor of Outside ...more","upc":"1809259a5a5f1d8d"},{"bookTitle":"Under the Tuscan Sun","bookPrice":"£37.33","noAvailable":"7","imageUrl":"http://books.toscrape.com/media/cache/45/21/4521c581ba727f5c835e34860cbf53e5.jpg","bookDescription":"A CLASSIC FROM THE BESTSELLING AUTHOR OF UNDER MAGNOLIAFrances Mayes—widely published poet, gourmet cook, and travel writer—opens the door to a wondrous new world when she buys and restores an abandoned villa in the spectacular Tuscan countryside. In evocative language, she brings the reader along as she discovers the beauty and simplicity of life in Italy. Mayes also crea A CLASSIC FROM THE BESTSELLING AUTHOR OF UNDER MAGNOLIAFrances Mayes—widely published poet, gourmet cook, and travel writer—opens the door to a wondrous new world when she buys and restores an abandoned villa in the spectacular Tuscan countryside. In evocative language, she brings the reader along as she discovers the beauty and simplicity of life in Italy. Mayes also creates dozens of delicious seasonal recipes from her traditional kitchen and simple garden, all of which she includes in the book. Doing for Tuscany what M.F.K. Fisher and Peter Mayle did for Provence, Mayes writes about the tastes and pleasures of a foreign country with gusto and passion. ...more","upc":"a94350ee74deaa07"},{"bookTitle":"A Summer In Europe","bookPrice":"£44.34","noAvailable":"7","imageUrl":"http://books.toscrape.com/media/cache/6c/e3/6ce3003931701c7a3fd5354917538ea9.jpg","bookDescription":"On her thirtieth birthday, Gwendolyn Reese receives an unexpected present from her widowed Aunt Bea: a grand tour of Europe in the company of Bea's Sudoku and Mahjongg Club. The prospect isn't entirely appealing. But when the gift she is expecting--an engagement ring from her boyfriend--doesn't materialize, Gwen decides to go. At first, Gwen approaches the trip as if it's On her thirtieth birthday, Gwendolyn Reese receives an unexpected present from her widowed Aunt Bea: a grand tour of Europe in the company of Bea's Sudoku and Mahjongg Club. The prospect isn't entirely appealing. But when the gift she is expecting--an engagement ring from her boyfriend--doesn't materialize, Gwen decides to go. At first, Gwen approaches the trip as if it's the math homework she assigns her students, diligently checking monuments off her must-see list. But amid the bougainvillea and stunning vistas of southern Italy, something changes. Gwen begins to live in the moment--skipping down stone staircases in Capri, running her fingers over a glacier in view of the Matterhorn, racing through the Louvre, and taste-testing pastries at a Marseilles cafe. Reveling in every new experience--especially her attraction to a charismatic British physics professor--Gwen discovers that the ancient wonders around her are nothing compared to the renaissance unfolding within. . . \"A thinking woman's love story, it swept me away to breathtaking places with a cast of endearing characters I won't soon forget. Bravissima!\" Susan McBride, author of \"Little Black Dress\" Praise for Marilyn Brant's According to Jane \"A warm, witty and charmingly original story.\" --Susan Wiggs, \"New York Times \" bestselling author \"Brant infuses her sweetly romantic and delightfully clever tale with just the right dash of Austen-esque wit.\" \"Chicago Tribune\" \"An engaging read for all who have been through the long, dark, dating wars, and still believe there's sunshine, and a Mr. Darcy, at the end of the tunnel.\" --Cathy Lamb, author of \"Such a Pretty Face\"\" ...more","upc":"cc1936a9f4e93477"},{"bookTitle":"The Great Railway Bazaar","bookPrice":"£30.54","noAvailable":"6","imageUrl":"http://books.toscrape.com/media/cache/d5/82/d582f6b0261c2842330e893962276295.jpg","bookDescription":"First published more than thirty years ago, Paul Theroux's strange, unique, and hugely entertaining railway odyssey has become a modern classic of travel literature. Here Theroux recounts his early adventures on an unusual grand continental tour. Asia's fabled trains -- the Orient Express, the Khyber Pass Local, the Frontier Mail, the Golden Arrow to Kuala Lumpur, the Mand First published more than thirty years ago, Paul Theroux's strange, unique, and hugely entertaining railway odyssey has become a modern classic of travel literature. Here Theroux recounts his early adventures on an unusual grand continental tour. Asia's fabled trains -- the Orient Express, the Khyber Pass Local, the Frontier Mail, the Golden Arrow to Kuala Lumpur, the Mandalay Express, the Trans-Siberian Express -- are the stars of a journey that takes him on a loop eastbound from London's Victoria Station to Tokyo Central, then back from Japan on the Trans-Siberian. Brimming with Theroux's signature humor and wry observations, this engrossing chronicle is essential reading for both the ardent adventurer and the armchair traveler. ...more","upc":"48736df57e7bec9f"},{"bookTitle":"A Year in Provence (Provence #1)","bookPrice":"£56.88","noAvailable":"6","imageUrl":"http://books.toscrape.com/media/cache/8b/81/8b81cd9b2c8f89a12099a80bed1c4911.jpg","bookDescription":"National BestsellerIn this witty and warm-hearted account, Peter Mayle tells what it is like to realize a long-cherished dream and actually move into a 200-year-old stone farmhouse in the remote country of the Lubéron with his wife and two large dogs. He endures January's frosty mistral as it comes howling down the Rhône Valley, discovers the secrets of goat racing through National Bestseller In this witty and warm-hearted account, Peter Mayle tells what it is like to realize a long-cherished dream and actually move into a 200-year-old stone farmhouse in the remote country of the Lubéron with his wife and two large dogs. He endures January's frosty mistral as it comes howling down the Rhône Valley, discovers the secrets of goat racing through the middle of town, and delights in the glorious regional cuisine. A Year in Provence transports us into all the earthy pleasures of Provençal life and lets us live vicariously at a tempo governed by seasons, not by days. ...more","upc":"9e60929f521fa280"},{"bookTitle":"The Road to Little Dribbling: Adventures of an American in Britain (Notes From a Small Island #2)","bookPrice":"£23.21","noAvailable":"3","imageUrl":"http://books.toscrape.com/media/cache/26/f5/26f5d20239a45046e756c6d09611b3ea.jpg","bookDescription":"The hilarious and loving sequel to a hilarious and loving classic of travel writing: Notes from a Small Island, Bill Bryson’s valentine to his adopted country of EnglandIn 1995 Bill Bryson got into his car and took a weeks-long farewell motoring trip about England before moving his family back to the United States. The book about that trip, Notes from a Small Island, is up The hilarious and loving sequel to a hilarious and loving classic of travel writing: Notes from a Small Island, Bill Bryson’s valentine to his adopted country of EnglandIn 1995 Bill Bryson got into his car and took a weeks-long farewell motoring trip about England before moving his family back to the United States. The book about that trip, Notes from a Small Island, is uproarious and endlessly endearing, one of the most acute and affectionate portrayals of England in all its glorious eccentricity ever written. Two decades later, he set out again to rediscover that country, and the result is The Road to Little Dribbling. Nothing is funnier than Bill Bryson on the road—prepare for the total joy and multiple episodes of unseemly laughter. ...more","upc":"366a236aa1ea6f07"},{"bookTitle":"Neither Here nor There: Travels in Europe","bookPrice":"£38.95","noAvailable":"3","imageUrl":"http://books.toscrape.com/media/cache/c9/9a/c99a7a05537cd842eb4db83d537e3a4d.jpg","bookDescription":"Bill Bryson's first travel book, The Lost Continent, was unanimously acclaimed as one of the funniest books in years. In Neither Here nor There he brings his unique brand of humour to bear on Europe as he shoulders his backpack, keeps a tight hold on his wallet, and journeys from Hammerfest, the northernmost town on the continent, to Istanbul on the cusp of Asia. Fluent in Bill Bryson's first travel book, The Lost Continent, was unanimously acclaimed as one of the funniest books in years. In Neither Here nor There he brings his unique brand of humour to bear on Europe as he shoulders his backpack, keeps a tight hold on his wallet, and journeys from Hammerfest, the northernmost town on the continent, to Istanbul on the cusp of Asia. Fluent in, oh, at least one language, he retraces his travels as a student twenty years before.Whether braving the homicidal motorist of Paris, being robbed by gypsies in Florence, attempting not to order tripe and eyeballs in a German restaurant, window-shopping in the sex shops of the Reeperbahn or disputing his hotel bill in Copenhagen, Bryson takes in the sights, dissects the culture and illuminates each place and person with his hilariously caustic observations. He even goes to Liechtenstein. ...more","upc":"747cf7fca2ccdbd4"},{"bookTitle":"1,000 Places to See Before You Die","bookPrice":"£26.08","noAvailable":"1","imageUrl":"http://books.toscrape.com/media/cache/9e/10/9e106f81f65b293e488718a4f54a6a3f.jpg","bookDescription":"Around the World, continent by continent, here is the best the world has to offer: 1,000 places guaranteed to give travelers the shivers. Sacred ruins, grand hotels, wildlife preserves, hilltop villages, snack shacks, castles, festivals, reefs, restaurants, cathedrals, hidden islands, opera houses, museums, and more. Each entry tells exactly why it's essential to visit. Th Around the World, continent by continent, here is the best the world has to offer: 1,000 places guaranteed to give travelers the shivers. Sacred ruins, grand hotels, wildlife preserves, hilltop villages, snack shacks, castles, festivals, reefs, restaurants, cathedrals, hidden islands, opera houses, museums, and more. Each entry tells exactly why it's essential to visit. Then come the nuts and bolts: addresses, websites, phone and fax numbers, best times to visit. Stop dreaming and get going.This hefty volume reminds vacationers that hot tourist spots are small percentage of what's worth seeing out there. A quick sampling: Venice's Cipriani Hotel; California's Monterey Peninsula; the Lewis and Clark Trail in Oregon; the Great Wall of China; Robert Louis Stevenson's home in Western Samoa; and the Alhambra in Andalusia, Spain. Veteran travel guide writer Schultz divides the book geographically, presenting a little less than a page on each location. Each entry lists exactly where to find the spot (e.g. Moorea is located \"12 miles/19 km northwest of Tahiti; 10 minutes by air, 1 hour by boat\") and when to go (e.g., if you want to check out The Complete Fly Fisher hotel in Montana, \"May and Sept.-Oct. offer productive angling in a solitary setting\"). This is an excellent resource for the intrepid traveler.Copyright 2003 Reed Business Information, Inc. ...more","upc":"228ba5e7577e1d49"}],"HistoricalFiction":[{"bookTitle":"Tipping the Velvet","bookPrice":"£53.74","noAvailable":"20","imageUrl":"http://books.toscrape.com/media/cache/08/e9/08e94f3731d7d6b760dfbfbc02ca5c62.jpg","bookDescription":"\"Erotic and absorbing...Written with starling power.\"--\"The New York Times Book Review \" Nan King, an oyster girl, is captivated by the music hall phenomenon Kitty Butler, a male impersonator extraordinaire treading the boards in Canterbury. Through a friend at the box office, Nan manages to visit all her shows and finally meet her heroine. Soon after, she becomes Kitty's \"Erotic and absorbing...Written with starling power.\"--\"The New York Times Book Review \" Nan King, an oyster girl, is captivated by the music hall phenomenon Kitty Butler, a male impersonator extraordinaire treading the boards in Canterbury. Through a friend at the box office, Nan manages to visit all her shows and finally meet her heroine. Soon after, she becomes Kitty's dresser and the two head for the bright lights of Leicester Square where they begin a glittering career as music-hall stars in an all-singing and dancing double act. At the same time, behind closed doors, they admit their attraction to each other and their affair begins. ...more","upc":"90fa61229261140a"},{"bookTitle":"Forever and Forever: The Courtship of Henry Longfellow and Fanny Appleton","bookPrice":"£29.69","noAvailable":"16","imageUrl":"http://books.toscrape.com/media/cache/f9/9e/f99e760b894d10c6e5ed578618918367.jpg","bookDescription":"A Proper Historical Romance seriesThe first book in a new series which will focus on the lives of real historical figures who have intriguing stories of courtship that are recreated in fictionalized accounts based on real biographical and social history research.\"A well-researched, emotionally charged tale. A love story...fit for the ages.\" -Publishers Weekly.It's 1836, an A Proper Historical Romance seriesThe first book in a new series which will focus on the lives of real historical figures who have intriguing stories of courtship that are recreated in fictionalized accounts based on real biographical and social history research.\"A well-researched, emotionally charged tale. A love story...fit for the ages.\" -Publishers Weekly.It's 1836, and nineteen-year-old Fanny Appleton, a privileged daughter of a wealthy, upper-class Boston industrialist, is touring Europe with her family. Like many girls of her day, she enjoys the fine clothes, food, and company of the elite social circles. But unlike her peers, Fanny is also drawn to education, literature, and more intellectual pursuits.Published author and poet Henry Wadsworth Longfellow is also touring Europe, but under much different circumstances. Widowed while on tour, he has stayed in order to gather credentials that he hopes will secure his professorship at Harvard College. When Henry meets Fanny, he sees in her a kindred spirit, a lover of language and literature and high ideals. He is in love. Fanny, however, is uncertain. He is ten years older than she is, and from a much lower social class. How could such a relationship ever thrive?Could a book of Henry’s poetry, personally delivered, persuade Fanny to believe in a love that lasts forever and forever? ...more","upc":"9beb96a2300109d7"},{"bookTitle":"A Flight of Arrows (The Pathfinders #2)","bookPrice":"£55.53","noAvailable":"16","imageUrl":"http://books.toscrape.com/media/cache/ec/65/ec651ed66822d4b68938afa645b1ece2.jpg","bookDescription":"October 1776--August 1777It is said that what a man sows he will reap--and for such a harvest there is no set season. No one connected to Reginald Aubrey is untouched by the crime he committed twenty years ago. Not William, the Oneida child Reginald stole and raised as his own. Identity shattered, enlisted in the British army, William trains with Loyalist refugees eager to October 1776--August 1777It is said that what a man sows he will reap--and for such a harvest there is no set season. No one connected to Reginald Aubrey is untouched by the crime he committed twenty years ago. Not William, the Oneida child Reginald stole and raised as his own. Identity shattered, enlisted in the British army, William trains with Loyalist refugees eager to annihilate the rebels who forced them into exile. Coming to terms with who and what he is proves impossible, but if he breaks his Loyalist oath, he'll be no better than the man who constructed his life of lies.Not Anna, Reginald's adopted daughter, nor Two Hawks, William's twin, both who long for Reginald to accept their love despite the challenges they will face, building a marriage that bridges two cultures. Not Good Voice and Stone Thrower, freed of bitterness by a courageous act of forgiveness, but still yearning for their firstborn son and fearful for the future of their Oneida people.As the British prepare to attack frontier New York and Patriot regiments rally to defend it, two families separated by culture, united by love, will do all in their power to reclaim the son marching toward them in the ranks of their enemies. ...more","upc":"3a6fb983e2554023"},{"bookTitle":"The House by the Lake","bookPrice":"£36.95","noAvailable":"15","imageUrl":"http://books.toscrape.com/media/cache/46/a2/46a2c968bfccf1979cc5576085eec6dd.jpg","bookDescription":"Anna is content with her well-ordered life in San Francisco. But her world is turned upside down when her beloved grandfather, Max, reveals a startling secret: Anna is part of an aristocratic family who lost everything during World War II. What’s more, Max was forced to leave behind a precious item over seventy years ago in their estate in old Prussia. It’s now his ardent Anna is content with her well-ordered life in San Francisco. But her world is turned upside down when her beloved grandfather, Max, reveals a startling secret: Anna is part of an aristocratic family who lost everything during World War II. What’s more, Max was forced to leave behind a precious item over seventy years ago in their estate in old Prussia. It’s now his ardent wish that Anna retrieve it.Anna burns with questions as she heads for Germany: What memento could be so important to her grandfather? And why did he keep their history hidden? As she searches for answers, she finds herself drawn to Wil, a man who may hold the key to unlock the mystery. Together they discover that her family’s secrets are linked with an abandoned apartment in Paris, and these secrets go deeper than she ever imagined.Alternating between 1930s Europe and the present, The House by the Lake illuminates the destiny of a family caught in the tumult of history. ...more","upc":"9287e238d7c3b06e"},{"bookTitle":"Mrs. Houdini","bookPrice":"£30.25","noAvailable":"15","imageUrl":"http://books.toscrape.com/media/cache/b4/45/b445dbc81ca3aff1321a6bf0d0fa231d.jpg","bookDescription":"A captivating debut novel, meticulously researched and beautifully imagined, about the passionate marriage of Harry and Bess Houdini—a love story that defied death itself.Before escape artist Harry Houdini died, he vowed he would find a way to speak to his beloved wife Bess from beyond the grave using a coded message known only to the two of them. When a widowed Bess begin A captivating debut novel, meticulously researched and beautifully imagined, about the passionate marriage of Harry and Bess Houdini—a love story that defied death itself.Before escape artist Harry Houdini died, he vowed he would find a way to speak to his beloved wife Bess from beyond the grave using a coded message known only to the two of them. When a widowed Bess begins seeing this code in seemingly impossible places, it becomes clear that Harry has an urgent message to convey. Unlocking the puzzle will set Bess on a course back through the pair’s extraordinary romance, which swept the illusionist and his bride from the beaches of Coney Island, to the palaces of Budapest, to the back lots of Hollywood. When the mystery finally leads Bess to the doorstep of a mysterious young photographer, she realizes that her husband’s magic may have been more than just illusion.In surprising turns that weave through the uncertain days of the dawn of the twentieth century and continue into the dazzling 1920s, Mrs. Houdini is a thrilling tale that will take you deep into the heart of one of history’s greatest love stories—asking what drives people to believe in something bigger than themselves—even as it reveals the famous magician’s most remarkable feat of all. ...more","upc":"a40723994f715420"},{"bookTitle":"The Marriage of Opposites","bookPrice":"£28.08","noAvailable":"14","imageUrl":"http://books.toscrape.com/media/cache/33/8e/338e196723f3fb10d5c6990fe54be61d.jpg","bookDescription":"From the New York Times bestselling author of The Dovekeepers and The Museum of Extraordinary Things: a forbidden love story set on the tropical island of St. Thomas about the extraordinary woman who gave birth to painter Camille Pissarro; the Father of Impressionism.Growing up on idyllic St. Thomas in the early 1800s, Rachel dreams of life in faraway Paris. Rachel's mothe From the New York Times bestselling author of The Dovekeepers and The Museum of Extraordinary Things: a forbidden love story set on the tropical island of St. Thomas about the extraordinary woman who gave birth to painter Camille Pissarro; the Father of Impressionism.Growing up on idyllic St. Thomas in the early 1800s, Rachel dreams of life in faraway Paris. Rachel's mother, a pillar of their small refugee community of Jews who escaped the Inquisition, has never forgiven her daughter for being a difficult girl who refuses to live by the rules. Growing up, Rachel's salvation is their maid Adelle's belief in her strengths, and her deep, life-long friendship with Jestine, Adelle's daughter. But Rachel's life is not her own. She is married off to a widower with three children to save her father's business. When her husband dies suddenly and his handsome, much younger nephew, Fréderick, arrives from France to settle the estate, Rachel seizes her own life story, beginning a defiant, passionate love affair that sparks a scandal that affects all of her family, including her favorite son, who will become one of the greatest artists of France.Building on the triumphs of The Dovekeepers and The Museum of Extraordinary Things, set in a world of almost unimaginable beauty, The Marriage of Opposites showcases the beloved, bestselling Alice Hoffman at the height of her considerable powers. Once forgotten to history, the marriage of Rachel and Fréderick is a story that is as unforgettable as it is remarkable. ...more","upc":"52cf2a5933ec5d8f"},{"bookTitle":"Glory over Everything: Beyond The Kitchen House","bookPrice":"£45.84","noAvailable":"14","imageUrl":"http://books.toscrape.com/media/cache/06/ac/06ac98df817412ce2419c4509fa98c80.jpg","bookDescription":"From the author of the New York Times bestseller and beloved book club favorite The Kitchen House, a novel of family and long-buried secrets along the treacherous Underground Railroad.Jamie Pyke, son of both a slave and master of Tall Oakes, has a deadly secret that compels him to take a treacherous journey through the Underground Railroad.Published in 2010, The Kitchen Ho From the author of the New York Times bestseller and beloved book club favorite The Kitchen House, a novel of family and long-buried secrets along the treacherous Underground Railroad.Jamie Pyke, son of both a slave and master of Tall Oakes, has a deadly secret that compels him to take a treacherous journey through the Underground Railroad.Published in 2010, The Kitchen House became a grassroots bestseller. Fans connected so deeply to the book’s characters that the author, Kathleen Grissom, found herself being asked over and over “what happens next?” The wait is finally over.This new, stand-alone novel opens in 1830, and Jamie, who fled from the Virginian plantation he once called home, is passing in Philadelphia society as a wealthy white silversmith. After many years of striving, Jamie has achieved acclaim and security, only to discover that his aristocratic lover Caroline is pregnant. Before he can reveal his real identity to her, he learns that his beloved servant Pan has been captured and sold into slavery in the South. Pan’s father, to whom Jamie owes a great debt, pleads for Jamie’s help, and Jamie agrees, knowing the journey will take him perilously close to Tall Oakes and the ruthless slave hunter who is still searching for him. Meanwhile, Caroline’s father learns and exposes Jamie’s secret, and Jamie loses his home, his business, and finally Caroline.Heartbroken and with nothing to lose, Jamie embarks on a trip to a North Carolina plantation where Pan is being held with a former Tall Oakes slave named Sukey, who is intent on getting Pan to the Underground Railroad. Soon the three of them are running through the Great Dismal Swamp, the notoriously deadly hiding place for escaped slaves. Though they have help from those in the Underground Railroad, not all of them will make it out alive. ...more","upc":"de4b403cb629a29f"},{"bookTitle":"Love, Lies and Spies","bookPrice":"£20.55","noAvailable":"12","imageUrl":"http://books.toscrape.com/media/cache/5c/19/5c19785278eaa6bf984ce6659847abc3.jpg","bookDescription":"Juliana Telford is not your average nineteenth-century young lady. She’s much more interested in researching ladybugs than marriage, fashionable dresses, or dances. So when her father sends her to London for a season, she’s determined not to form any attachments. Instead, she plans to secretly publish their research.Spencer Northam is not the average young gentleman of lei Juliana Telford is not your average nineteenth-century young lady. She’s much more interested in researching ladybugs than marriage, fashionable dresses, or dances. So when her father sends her to London for a season, she’s determined not to form any attachments. Instead, she plans to secretly publish their research.Spencer Northam is not the average young gentleman of leisure he appears. He is actually a spy for the War Office, and is more focused on acing his first mission than meeting eligible ladies. Fortunately, Juliana feels the same, and they agree to pretend to fall for each other. Spencer can finally focus, until he is tasked with observing Juliana’s traveling companions . . . and Juliana herself. ...more","upc":"9546d537fbf99eb6"},{"bookTitle":"A Paris Apartment","bookPrice":"£39.01","noAvailable":"12","imageUrl":"http://books.toscrape.com/media/cache/b3/d9/b3d90aca157d5a250becc8b255a37251.jpg","bookDescription":"Bienvenue à Paris!When April Vogt's boss tells her about an apartment in the ninth arrondissement that has been discovered after being shuttered for the past seventy years, the Sotheby's continental furniture specialist does not hear the words “dust” or “rats” or “decrepit.” She hears Paris. She hears escape.Once in France, April quickly learns the apartment is not merely Bienvenue à Paris!When April Vogt's boss tells her about an apartment in the ninth arrondissement that has been discovered after being shuttered for the past seventy years, the Sotheby's continental furniture specialist does not hear the words “dust” or “rats” or “decrepit.” She hears Paris. She hears escape.Once in France, April quickly learns the apartment is not merely some rich hoarder's repository. Beneath the cobwebs and stale perfumed air is a goldmine, and not because of the actual gold (or painted ostrich eggs or mounted rhinoceros horns or bronze bathtub). First, there's a portrait by one of the masters of the Belle Epoque, Giovanni Boldini. And then there are letters and journals written by the very woman in the painting, Marthe de Florian. These documents reveal that she was more than a renowned courtesan with enviable decolletage. Suddenly April's quest is no longer about the bureaux plats and Louis-style armchairs that will fetch millions at auction. It's about discovering the story behind this charismatic woman.It's about discovering two women, actually.With the help of a salty (and annoyingly sexy) Parisian solicitor and the courtesan's private diaries, April tries to uncover the many secrets buried in the apartment. As she digs into Marthe's life, April can't help but take a deeper look into her own. Having left behind in the States a cheating husband, a family crisis about to erupt, and a career she's been using as the crutch to simply get by, she feels compelled to sort out her own life too. When the things she left bubbling back home begin to boil over, and Parisian delicacies beyond flaky pâtisseries tempt her better judgment, April knows that both she and Marthe deserve happy finales.Whether accompanied by croissants or champagne, this delectable debut novel depicts the Paris of the Belle Epoque and the present day with vibrant and stunning allure. Based on historical events, Michelle Gable's A Paris Apartment will entertain and inspire, as readers embrace the struggles and successes of two very unforgettable women. ...more","upc":"63343e287971bb0c"},{"bookTitle":"Lilac Girls","bookPrice":"£17.28","noAvailable":"11","imageUrl":"http://books.toscrape.com/media/cache/c0/80/c080a1626edf581b780420db13e7b074.jpg","bookDescription":"Inspired by the life of a real World War II heroine, this debut novel reveals a story of love, redemption, and secrets that were hidden for decades.New York socialite Caroline Ferriday has her hands full with her post at the French consulate and a new love on the horizon. But Caroline’s world is forever changed when Hitler’s army invades Poland in September 1939—and then s Inspired by the life of a real World War II heroine, this debut novel reveals a story of love, redemption, and secrets that were hidden for decades. New York socialite Caroline Ferriday has her hands full with her post at the French consulate and a new love on the horizon. But Caroline’s world is forever changed when Hitler’s army invades Poland in September 1939—and then sets its sights on France.   An ocean away from Caroline, Kasia Kuzmerick, a Polish teenager, senses her carefree youth disappearing as she is drawn deeper into her role as courier for the underground resistance movement. In a tense atmosphere of watchful eyes and suspecting neighbors, one false move can have dire consequences.   For the ambitious young German doctor, Herta Oberheuser, an ad for a government medical position seems her ticket out of a desolate life. Once hired, though, she finds herself trapped in a male-dominated realm of Nazi secrets and power.   The lives of these three women are set on a collision course when the unthinkable happens and Kasia is sent to Ravensbrück, the notorious Nazi concentration camp for women. Their stories cross continents—from New York to Paris, Germany, and Poland—as Caroline and Kasia strive to bring justice to those whom history has forgotten. ...more","upc":"bade9943ee01b63f"},{"bookTitle":"The Constant Princess (The Tudor Court #1)","bookPrice":"£16.62","noAvailable":"7","imageUrl":"http://books.toscrape.com/media/cache/ed/52/ed52651826bb23d853aead2753c9befc.jpg","bookDescription":"\"I am Catalina, Princess of Spain, daughter of the two greatest monarchs the world has ever known...and I will be Queen of England.\"Thus, bestselling author Philippa Gregory introduces one of her most unforgettable heroines: Katherine of Aragon. Known to history as the Queen who was pushed off her throne by Anne Boleyn, here is a Katherine the world has forgotten: the ench \"I am Catalina, Princess of Spain, daughter of the two greatest monarchs the world has ever known...and I will be Queen of England.\"Thus, bestselling author Philippa Gregory introduces one of her most unforgettable heroines: Katherine of Aragon. Known to history as the Queen who was pushed off her throne by Anne Boleyn, here is a Katherine the world has forgotten: the enchanting princess that all England loved. First married to Henry VIII's older brother, Arthur, Katherine's passion turns their arranged marriage into a love match; but when Arthur dies, the merciless English court and her ambitious parents -- the crusading King and Queen of Spain -- have to find a new role for the widow. Ultimately, it is Katherine herself who takes control of her own life by telling the most audacious lie in English history, leading her to the very pinnacle of power in England.Set in the rich beauty of Moorish Spain and the glamour of the Tudor court, The Constant Princess presents a woman whose constancy helps her endure betrayal, poverty, and despair, until the inevitable moment when she steps into the role she has prepared for all her life: Henry VIII's Queen, Regent, and commander of the English army in their greatest victory against Scotland. ...more","upc":"24933c712f0bca2f"},{"bookTitle":"The Invention of Wings","bookPrice":"£37.34","noAvailable":"6","imageUrl":"http://books.toscrape.com/media/cache/7a/b0/7ab00e6956f540bfe0018656d5bfe1e4.jpg","bookDescription":"Writing at the height of her narrative and imaginative gifts, Sue Monk Kidd presents a masterpiece of hope, daring, the quest for freedom, and the desire to have a voice in the world—and it is now the newest Oprah’s Book Club 2.0 selection.Hetty “Handful” Grimke, an urban slave in early nineteenth century Charleston, yearns for life beyond the suffocating walls that enclos Writing at the height of her narrative and imaginative gifts, Sue Monk Kidd presents a masterpiece of hope, daring, the quest for freedom, and the desire to have a voice in the world—and it is now the newest Oprah’s Book Club 2.0 selection.Hetty “Handful” Grimke, an urban slave in early nineteenth century Charleston, yearns for life beyond the suffocating walls that enclose her within the wealthy Grimke household. The Grimke’s daughter, Sarah, has known from an early age she is meant to do something large in the world, but she is hemmed in by the limits imposed on women.Kidd’s sweeping novel is set in motion on Sarah’s eleventh birthday, when she is given ownership of ten year old Handful, who is to be her handmaid. We follow their remarkable journeys over the next thirty five years, as both strive for a life of their own, dramatically shaping each other’s destinies and forming a complex relationship marked by guilt, defiance, estrangement and the uneasy ways of love.As the stories build to a riveting climax, Handful will endure loss and sorrow, finding courage and a sense of self in the process. Sarah will experience crushed hopes, betrayal, unrequited love, and ostracism before leaving Charleston to find her place alongside her fearless younger sister, Angelina, as one of the early pioneers in the abolition and women’s rights movements.Inspired by the historical figure of Sarah Grimke, Kidd goes beyond the record to flesh out the rich interior lives of all of her characters, both real and invented, including Handful’s cunning mother, Charlotte, who courts danger in her search for something better.This exquisitely written novel is a triumph of storytelling that looks with unswerving eyes at a devastating wound in American history, through women whose struggles for liberation, empowerment, and expression will leave no reader unmoved. ...more","upc":"e6635f5b0a2c78db"},{"bookTitle":"World Without End (The Pillars of the Earth #2)","bookPrice":"£32.97","noAvailable":"5","imageUrl":"http://books.toscrape.com/media/cache/58/b5/58b5730dd82cbcf6560cf0ab8b56cd9f.jpg","bookDescription":"Eighteen years after the publication of The Pillars of the Earth, Ken Follett has written the the long awaited sequel, World Without End. World Without End takes place in the same town of Kingsbridge, two centuries after the townspeople finished building the exquisite Gothic cathedral that was at the heart of The Pillars of the Earth. The cathedral and the priory are agai Eighteen years after the publication of The Pillars of the Earth, Ken Follett has written the the long awaited sequel, World Without End. World Without End takes place in the same town of Kingsbridge, two centuries after the townspeople finished building the exquisite Gothic cathedral that was at the heart of The Pillars of the Earth. The cathedral and the priory are again at the center of a web of love and hate, greed and pride, ambition and revenge, but this sequel stands on its own. This time, the men and women among an extraordinary cast of characters find themselves at a crossroad of new ideas -- about medicine, commerce, architecture, and justice. In a world where proponents of the old ways fiercely battle those with progressive minds, the intrigue and tension quickly reach a boiling point against the devastating backdrop of the greatest natural disaster ever to strike the human race: the Black Death. ...more","upc":"2e5b4ff08a75fd02"},{"bookTitle":"The Passion of Dolssa","bookPrice":"£28.32","noAvailable":"4","imageUrl":"http://books.toscrape.com/media/cache/b3/59/b35975c0df26c40964028a8ccabc9a91.jpg","bookDescription":"Dolssa is a young gentlewoman with uncanny gifts, on the run from an obsessed friar determined to burn her as a heretic for the passion she refuses to tame.Botille is a wily and charismatic peasant, a matchmaker running a tavern with her two sisters in a tiny seaside town.The year is 1241; the place, Provensa, what we now call Provence, France—a land still reeling from the Dolssa is a young gentlewoman with uncanny gifts, on the run from an obsessed friar determined to burn her as a heretic for the passion she refuses to tame.Botille is a wily and charismatic peasant, a matchmaker running a tavern with her two sisters in a tiny seaside town.The year is 1241; the place, Provensa, what we now call Provence, France—a land still reeling from the bloody crusades waged there by the Catholic Church and its northern French armies.When the matchmaker finds the mystic near death by a riverside, Botille takes Dolssa in and discovers the girl’s extraordinary healing power. But as the vengeful Friar Lucien hunts down his heretic, the two girls find themselves putting an entire village at the mercy of murderers. ...more","upc":"011674f4a3834b8d"},{"bookTitle":"Girl With a Pearl Earring","bookPrice":"£26.77","noAvailable":"4","imageUrl":"http://books.toscrape.com/media/cache/b1/5e/b15ec9da5c7b28e2d11347dd2e8c20e5.jpg","bookDescription":"With precisely 35 canvases to his credit, the Dutch painter Johannes Vermeer represents one of the great enigmas of 17th-century art. The meager facts of his biography have been gleaned from a handful of legal documents. Yet Vermeer's extraordinary paintings of domestic life, with their subtle play of light and texture, have come to define the Dutch golden age. His portrai With precisely 35 canvases to his credit, the Dutch painter Johannes Vermeer represents one of the great enigmas of 17th-century art. The meager facts of his biography have been gleaned from a handful of legal documents. Yet Vermeer's extraordinary paintings of domestic life, with their subtle play of light and texture, have come to define the Dutch golden age. His portrait of the anonymous Girl with a Pearl Earring has exerted a particular fascination for centuries--and it is this magnetic painting that lies at the heart of Tracy Chevalier's second novel of the same title.Girl with a Pearl Earring centers on Vermeer's prosperous Delft household during the 1660s. When Griet, the novel's quietly perceptive heroine, is hired as a servant, turmoil follows. First, the 16-year-old narrator becomes increasingly intimate with her master. Then Vermeer employs her as his assistant--and ultimately has Griet sit for him as a model. ...more","upc":"5eff05e59f905a49"},{"bookTitle":"Voyager (Outlander #3)","bookPrice":"£21.07","noAvailable":"3","imageUrl":"http://books.toscrape.com/media/cache/6e/22/6e22497cbecedef59be86d1328e4b044.jpg","bookDescription":"From the author of the breathtaking bestsellers Outlander and Dragonfly in Amber, the extraordinary saga continues.Their passionate encounter happened long ago by whatever measurement Claire Randall took. Two decades before, she had traveled back in time and into the arms of a gallant eighteenth-century Scot named Jamie Fraser. Then she returned to her own century to bear From the author of the breathtaking bestsellers Outlander and Dragonfly in Amber, the extraordinary saga continues.Their passionate encounter happened long ago by whatever measurement Claire Randall took. Two decades before, she had traveled back in time and into the arms of a gallant eighteenth-century Scot named Jamie Fraser. Then she returned to her own century to bear his child, believing him dead in the tragic battle of Culloden. Yet his memory has never lessened its hold on her... and her body still cries out for him in her dreams.Then Claire discovers that Jamie survived. Torn between returning to him and staying with their daughter in her own era, Claire must choose her destiny. And as time and space come full circle, she must find the courage to face the passion and pain awaiting her...the deadly intrigues raging in a divided Scotland... and the daring voyage into the dark unknown that can reunite or forever doom her timeless love. ...more","upc":"7feac4000cbc5859"},{"bookTitle":"The Red Tent","bookPrice":"£35.66","noAvailable":"3","imageUrl":"http://books.toscrape.com/media/cache/15/59/155942710c3ae4bd4ed622df9a999b99.jpg","bookDescription":"Her name is Dinah. In the Bible, her life is only hinted at in a brief and violent detour within the more familiar chapters of the Book of Genesis that are about her father, Jacob, and his dozen sons. Told in Dinah's voice, this novel reveals the traditions and turmoils of ancient womanhood--the world of the red tent. It begins with the story of her mothers--Leah, Rachel, Her name is Dinah. In the Bible, her life is only hinted at in a brief and violent detour within the more familiar chapters of the Book of Genesis that are about her father, Jacob, and his dozen sons. Told in Dinah's voice, this novel reveals the traditions and turmoils of ancient womanhood--the world of the red tent. It begins with the story of her mothers--Leah, Rachel, Zilpah, and Bilhah--the four wives of Jacob. They love Dinah and give her gifts that sustain her through a hard-working youth, a calling to midwifery, and a new home in a foreign land. Dinah's story reaches out from a remarkable period of early history and creates an intimate connection with the past. Deeply affecting, The Red Tent combines rich storytelling with a valuable achievement in modern fiction: a new view of biblical women's society. ...more","upc":"3c456328b04a8ee8"},{"bookTitle":"The Last Painting of Sara de Vos","bookPrice":"£55.55","noAvailable":"3","imageUrl":"http://books.toscrape.com/media/cache/1c/e4/1ce4c2573d65ebdc3c85d9a6592d57b1.jpg","bookDescription":"This is what we long for: the profound pleasure of being swept into vivid new worlds, worlds peopled by characters so intriguing and real that we can't shake them, even long after the reading's done. In his earlier, award-winning novels, Dominic Smith demonstrated a gift for coaxing the past to life. Now, in The Last Painting of Sara de Vos, he deftly bridges the historica This is what we long for: the profound pleasure of being swept into vivid new worlds, worlds peopled by characters so intriguing and real that we can't shake them, even long after the reading's done. In his earlier, award-winning novels, Dominic Smith demonstrated a gift for coaxing the past to life. Now, in The Last Painting of Sara de Vos, he deftly bridges the historical and the contemporary, tracking a collision course between a rare landscape by a female Dutch painter of the golden age, an inheritor of the work in 1950s Manhattan, and a celebrated art historian who painted a forgery of it in her youth.In 1631, Sara de Vos is admitted as a master painter to the Guild of St. Luke's in Holland, the first woman to be so recognized. Three hundred years later, only one work attributed to de Vos is known to remain--a haunting winter scene, At the Edge of a Wood, which hangs over the bed of a wealthy descendant of the original owner. An Australian grad student, Ellie Shipley, struggling to stay afloat in New York, agrees to paint a forgery of the landscape, a decision that will haunt her. Because now, half a century later, she's curating an exhibit of female Dutch painters, and both versions threaten to arrive. As the three threads intersect, The Last Painting of Sara de Vos mesmerizes while it grapples with the demands of the artistic life, showing how the deceits of the past can forge the present. ...more","upc":"476c7972e9b41891"},{"bookTitle":"The Guernsey Literary and Potato Peel Pie Society","bookPrice":"£49.53","noAvailable":"3","imageUrl":"http://books.toscrape.com/media/cache/98/e3/98e3925e5e6a66acf2cde918fc147205.jpg","bookDescription":"“ I wonder how the book got to Guernsey? Perhaps there is some sort of secret homing instinct in books that brings them to their perfect readers.” January 1946: London is emerging from the shadow of the Second World War, and writer Juliet Ashton is looking for her next book subject. Who could imagine that she would find it in a letter from a man she’s never met, a native o “ I wonder how the book got to Guernsey? Perhaps there is some sort of secret homing instinct in books that brings them to their perfect readers.” January 1946: London is emerging from the shadow of the Second World War, and writer Juliet Ashton is looking for her next book subject. Who could imagine that she would find it in a letter from a man she’s never met, a native of the island of Guernsey, who has come across her name written inside a book by Charles Lamb….As Juliet and her new correspondent exchange letters, Juliet is drawn into the world of this man and his friends—and what a wonderfully eccentric world it is. The Guernsey Literary and Potato Peel Pie Society—born as a spur-of-the-moment alibi when its members were discovered breaking curfew by the Germans occupying their island—boasts a charming, funny, deeply human cast of characters, from pig farmers to phrenologists, literature lovers all.Juliet begins a remarkable correspondence with the society’s members, learning about their island, their taste in books, and the impact the recent German occupation has had on their lives. Captivated by their stories, she sets sail for Guernsey, and what she finds will change her forever.Written with warmth and humor as a series of letters, this novel is a celebration of the written word in all its guises, and of finding connection in the most surprising ways. ...more","upc":"4a0a276409968a73"},{"bookTitle":"Girl in the Blue Coat","bookPrice":"£46.83","noAvailable":"3","imageUrl":"http://books.toscrape.com/media/cache/15/ea/15eaabd188af8916c4a37d135f7b8952.jpg","bookDescription":"Amsterdam, 1943. Hanneke spends her days finding and delivering sought-after black market goods to paying customers, nights hiding the true nature of her work from her concerned parents, and every waking moment mourning her boyfriend, who was killed on the Dutch front lines when the German army invaded. Her illegal work keeps her family afloat, and Hanneke also likes to th Amsterdam, 1943. Hanneke spends her days finding and delivering sought-after black market goods to paying customers, nights hiding the true nature of her work from her concerned parents, and every waking moment mourning her boyfriend, who was killed on the Dutch front lines when the German army invaded. Her illegal work keeps her family afloat, and Hanneke also likes to think of it as a small act of rebellion against the Nazis.On a routine delivery, a client asks Hanneke for help. Expecting to hear that Mrs. Janssen wants meat or kerosene, Hanneke is shocked by the older woman’s frantic plea to find a person: a Jewish teenager Mrs. Janssen had been hiding, who has vanished without a trace from a secret room. Hanneke initially wants nothing to do with such a dangerous task but is ultimately drawn into a web of mysteries and stunning revelations—where the only way out is through.Beautifully written, intricately plotted, and meticulously researched, Girl in the Blue Coat is an extraordinary, unforgettable story of bravery, grief, and love in impossible times. ...more","upc":"41fc5dce044f16f5"},{"bookTitle":"Between Shades of Gray","bookPrice":"£20.79","noAvailable":"3","imageUrl":"http://books.toscrape.com/media/cache/df/45/df45004c7a4c3940946ad09f85805565.jpg","bookDescription":"Lina is just like any other fifteen-year-old Lithuanian girl in 1941. She paints, she draws, she gets crushes on boys. Until one night when Soviet officers barge into her home, tearing her family from the comfortable life they've known. Separated from her father, forced onto a crowded and dirty train car, Lina, her mother, and her young brother slowly make their way north, Lina is just like any other fifteen-year-old Lithuanian girl in 1941. She paints, she draws, she gets crushes on boys. Until one night when Soviet officers barge into her home, tearing her family from the comfortable life they've known. Separated from her father, forced onto a crowded and dirty train car, Lina, her mother, and her young brother slowly make their way north, crossing the Arctic Circle, to a work camp in the coldest reaches of Siberia. Here they are forced, under Stalin's orders, to dig for beets and fight for their lives under the cruelest of conditions. Lina finds solace in her art, meticulously--and at great risk--documenting events by drawing, hoping these messages will make their way to her father's prison camp to let him know they are still alive. It is a long and harrowing journey, spanning years and covering 6,500 miles, but it is through incredible strength, love, and hope that Lina ultimately survives. Between Shades of Gray is a novel that will steal your breath and capture your heart. ...more","upc":"155e42df837ee5ff"},{"bookTitle":"While You Were Mine","bookPrice":"£41.32","noAvailable":"1","imageUrl":"http://books.toscrape.com/media/cache/4f/7c/4f7cde01c9711886ef5a8fa14996a52d.jpg","bookDescription":"Everything she loved could so easily be lost.The end of World War II should have brought joy to Gwen Mullen. But on V-J Day, her worst fear is realized. As celebrating crowds gather in Times Square, a soldier appears on her doorstep to claim Mary, the baby abandoned to Gwen one year earlier. Suddenly Gwen is on the verge of losing the child she has nurtured and loves dearl Everything she loved could so easily be lost.The end of World War II should have brought joy to Gwen Mullen. But on V-J Day, her worst fear is realized. As celebrating crowds gather in Times Square, a soldier appears on her doorstep to claim Mary, the baby abandoned to Gwen one year earlier. Suddenly Gwen is on the verge of losing the child she has nurtured and loves dearly.With no legal claim to Mary, Gwen begins to teach Lieutenant John McKee how to care for his child, knowing that he will ultimately take Mary away. What starts as a contentious relationship, however, turns into something more, and Gwen must open her heart to learn that love means taking chances.While You Were Mine paints a vivid portrait of 1940s New York and tells an enchanting tale of the nature of love and trust. ...more","upc":"8ceb5c6aed2c5f8b"},{"bookTitle":"The Secret Healer","bookPrice":"£34.56","noAvailable":"1","imageUrl":"http://books.toscrape.com/media/cache/3e/59/3e59b2225c72d3dcf40a306e2b983314.jpg","bookDescription":"In the fourteenth century, opportunities for women are limited to the home. But spirited young Madlen finds her calling as assistant to the city’s trusted midwife, Clara. Working alongside Clara, Madlen develops a surprisingly soothing technique and quickly becomes a talented healer.After Clara’s tragic death, Madlen alone rushes to assist the birth of a local nobleman’s c In the fourteenth century, opportunities for women are limited to the home. But spirited young Madlen finds her calling as assistant to the city’s trusted midwife, Clara. Working alongside Clara, Madlen develops a surprisingly soothing technique and quickly becomes a talented healer.After Clara’s tragic death, Madlen alone rushes to assist the birth of a local nobleman’s child. But rather than the joy of birth, Madlen walks into an accusation of murder and witchcraft because of her extraordinary gifts. Forced to flee her own town, she establishes a new identity in the home of her aunt. Yet even though it endangers her life, she cannot resist the urge to help the sick patients who seek out her miraculous treatment. When she meets handsome Johannes—an investigator hired by the Church to bring her to justice for sacrilegious acts—she becomes drawn to the very man who could destroy her.Will Madlen’s gifts bring about her downfall? Or can love and reason prevail in a time of fearful superstition? ...more","upc":"38f776ab9118aed7"},{"bookTitle":"Starlark","bookPrice":"£25.83","noAvailable":"1","imageUrl":"http://books.toscrape.com/media/cache/76/e2/76e2881d47f2da9283e52d3c57eef532.jpg","bookDescription":"On the morning of her wedding, Roma awakens to find that a 21st century eclipse has swept her through time and space to medieval Ireland—a land bedevilled with strife, conflict and danger at every possible turn. Soon caught up in an intricate spider’s web of political intrigue, Roma is forced to ally herself and marry a man she passionately hates—a cocky, rugged, silver-to On the morning of her wedding, Roma awakens to find that a 21st century eclipse has swept her through time and space to medieval Ireland—a land bedevilled with strife, conflict and danger at every possible turn. Soon caught up in an intricate spider’s web of political intrigue, Roma is forced to ally herself and marry a man she passionately hates—a cocky, rugged, silver-tongued Irish warrior—and the only man who can protect her from the dark forces at work on the Emerald Isle… For under the rolling green hills of the ancient Irish countryside lies a powerful force that even today is only spoken of in hushed tones. And as the war deepens, Roma finds herself falling for the one man she swore that she never would—her husband, Fionn, whose fierce passion drives her crazy despite herself. Roma’s a very long way from home—but her battle has only just begun, and now she needs Fionn’s help more than ever to succeed…and craves his touch more than ever to survive. Rich in historical detail and breathtaking romance, prepare to be swept back in time to the lush mythology, epic legends, and Celtic magic of STARLARK’s medieval Ireland—and the spellbinding tale of a love so absolute it transcends time itself… ...more","upc":"e25164e5b3fe208b"},{"bookTitle":"Lost Among the Living","bookPrice":"£27.70","noAvailable":"1","imageUrl":"http://books.toscrape.com/media/cache/5f/03/5f0345cd81aaad65bb9f6a34ec0f6b9b.jpg","bookDescription":"England, 1921. Three years after her husband, Alex, disappeared, shot down over Germany, Jo Manders still mourns his loss. Working as a paid companion to Alex's wealthy, condescending aunt, Dottie Forsyth, Jo travels to the family’s estate in the Sussex countryside. But there is much she never knew about her husband’s origins…and the revelation of a mysterious death in the England, 1921. Three years after her husband, Alex, disappeared, shot down over Germany, Jo Manders still mourns his loss. Working as a paid companion to Alex's wealthy, condescending aunt, Dottie Forsyth, Jo travels to the family’s estate in the Sussex countryside. But there is much she never knew about her husband’s origins…and the revelation of a mysterious death in the Forsyths’ past is just the beginning…All is not well at Wych Elm House. Dottie's husband is distant, and her son was grievously injured in the war. Footsteps follow Jo down empty halls, and items in her bedroom are eerily rearranged. The locals say the family is cursed, and that a ghost in the woods has never rested. And when Jo discovers her husband’s darkest secrets, she wonders if she ever really knew him. Isolated in a place of deception and grief, she must find the truth or lose herself forever.And then a familiar stranger arrives at Wych Elm House… ...more","upc":"d510567580c8be52"},{"bookTitle":"A Spy's Devotion (The Regency Spies of London #1)","bookPrice":"£16.97","noAvailable":"1","imageUrl":"http://books.toscrape.com/media/cache/f9/6b/f96b60a7614c4e3e868b82f6811efc7c.jpg","bookDescription":"In England’s Regency era, manners and elegance reign in public life—but behind closed doors treason and tawdriness thrive. Nicholas Langdon is no stranger to reserved civility or bloody barbarity. After suffering a battlefield injury, the wealthy, well-connected British officer returns home to heal—and to fulfill a dying soldier’s last wish by delivering his coded diary.At In England’s Regency era, manners and elegance reign in public life—but behind closed doors treason and tawdriness thrive. Nicholas Langdon is no stranger to reserved civility or bloody barbarity. After suffering a battlefield injury, the wealthy, well-connected British officer returns home to heal—and to fulfill a dying soldier’s last wish by delivering his coded diary.At the home of the Wilherns, one of England’s most powerful families, Langdon attends a lavish ball where he meets their beautiful and intelligent ward, Julia Grey. Determined to maintain propriety, he keeps his distance—until the diary is stolen and all clues lead to Julia’s guardian. As Langdon traces an evil plot that could be the nation’s undoing, he grows ever more intrigued by the lovely young woman. And when Julia realizes that England—and the man she is falling in love with—need her help, she finds herself caught in the fray. Will the two succumb to their attraction while fighting to save their country? ...more","upc":"19fec36a1dfb4c16"}],"Mystery":[{"bookTitle":"Sharp Objects","bookPrice":"£47.82","noAvailable":"20","imageUrl":"http://books.toscrape.com/media/cache/c0/59/c05972805aa7201171b8fc71a5b00292.jpg","bookDescription":"WICKED above her hipbone, GIRL across her heart Words are like a road map to reporter Camille Preaker’s troubled past. Fresh from a brief stay at a psych hospital, Camille’s first assignment from the second-rate daily paper where she works brings her reluctantly back to her hometown to cover the murders of two preteen girls. NASTY on her kneecap, BABYDOLL on her leg Since WICKED above her hipbone, GIRL across her heart Words are like a road map to reporter Camille Preaker’s troubled past. Fresh from a brief stay at a psych hospital, Camille’s first assignment from the second-rate daily paper where she works brings her reluctantly back to her hometown to cover the murders of two preteen girls. NASTY on her kneecap, BABYDOLL on her leg Since she left town eight years ago, Camille has hardly spoken to her neurotic, hypochondriac mother or to the half-sister she barely knows: a beautiful thirteen-year-old with an eerie grip on the town. Now, installed again in her family’s Victorian mansion, Camille is haunted by the childhood tragedy she has spent her whole life trying to cut from her memory. HARMFUL on her wrist, WHORE on her ankle As Camille works to uncover the truth about these violent crimes, she finds herself identifying with the young victims—a bit too strongly. Clues keep leading to dead ends, forcing Camille to unravel the psychological puzzle of her own past to get at the story. Dogged by her own demons, Camille will have to confront what happened to her years before if she wants to survive this homecoming.With its taut, crafted writing, Sharp Objects is addictive, haunting, and unforgettable. ...more","upc":"e00eb4fd7b871a48"},{"bookTitle":"In a Dark, Dark Wood","bookPrice":"£19.63","noAvailable":"18","imageUrl":"http://books.toscrape.com/media/cache/95/84/95840dfd67c020067c99d70451147e20.jpg","bookDescription":"In a dark, dark wood Nora hasn't seen Clare for ten years. Not since Nora walked out of school one day and never went back. There was a dark, dark houseUntil, out of the blue, an invitation to Clare’s hen do arrives. Is this a chance for Nora to finally put her past behind her?And in the dark, dark house there was a dark, dark roomBut something goes wrong. Very wrong.And i In a dark, dark wood Nora hasn't seen Clare for ten years. Not since Nora walked out of school one day and never went back. There was a dark, dark houseUntil, out of the blue, an invitation to Clare’s hen do arrives. Is this a chance for Nora to finally put her past behind her?And in the dark, dark house there was a dark, dark roomBut something goes wrong. Very wrong.And in the dark, dark room.... Some things can’t stay secret for ever. ...more","upc":"19ed25f4641d5efd"},{"bookTitle":"The Past Never Ends","bookPrice":"£56.50","noAvailable":"16","imageUrl":"http://books.toscrape.com/media/cache/9d/f2/9df248dcefeaba9eeb519a59b248f72c.jpg","bookDescription":"A simple task, Attorney Chester Morgan thinks. Get a copy of a public record for a young man whose only friend has died in an unexplained accidental death. Except... The police file regarding the demise of sex worker Tanya Everly has been sealed by the order of the chief of police, and no one will talk. Warned to drop the matter, Attorney Morgan knows that if he doesn't sp A simple task, Attorney Chester Morgan thinks. Get a copy of a public record for a young man whose only friend has died in an unexplained accidental death. Except... The police file regarding the demise of sex worker Tanya Everly has been sealed by the order of the chief of police, and no one will talk. Warned to drop the matter, Attorney Morgan knows that if he doesn't speak for the dead young woman, no one will. Haunted by his discovery of the body of a prominent local oilman, Morgan pursues a quest for justice that puts his reputation, career, and life at risk. A journey that takes him into the dark shadows of the sex-for-sale business, into the marble courtrooms of Oklahoma, and into the aching loneliness of his own soul. Set in the American Southwest in the days before 9/11, The Past Never Ends is both a complex murder mystery and a meditation on the self-perpetuating nature of injustice and the ethereal nature of justice itself. ...more","upc":"5ee94540d0749ea0"},{"bookTitle":"A Murder in Time","bookPrice":"£16.64","noAvailable":"16","imageUrl":"http://books.toscrape.com/media/cache/cc/bd/ccbd7a62caefd5a3a2e04dd7c2ff48fe.jpg","bookDescription":"Beautiful and brilliant, Kendra Donovan is a rising star at the FBI. Yet her path to professional success hits a speed bump during a disastrous raid where half her team is murdered, a mole in the FBI is uncovered and she herself is severely wounded. As soon as she recovers, she goes rogue and travels to England to assassinate the man responsible for the deaths of her teamm Beautiful and brilliant, Kendra Donovan is a rising star at the FBI. Yet her path to professional success hits a speed bump during a disastrous raid where half her team is murdered, a mole in the FBI is uncovered and she herself is severely wounded. As soon as she recovers, she goes rogue and travels to England to assassinate the man responsible for the deaths of her teammates.While fleeing from an unexpected assassin herself, Kendra escapes into a stairwell that promises sanctuary but when she stumbles out again, she is in the same place - Aldrich Castle - but in a different time: 1815, to be exact.Mistaken for a lady's maid hired to help with weekend guests, Kendra is forced to quickly adapt to the time period until she can figure out how she got there; and, more importantly, how to get back home. However, after the body of a young girl is found on the extensive grounds of the county estate, she starts to feel there's some purpose to her bizarre circumstances. Stripped of her twenty-first century tools, Kendra must use her wits alone in order to unmask a cunning madman. ...more","upc":"f733e8c19d40ec2e"},{"bookTitle":"The Murder of Roger Ackroyd (Hercule Poirot #4)","bookPrice":"£44.10","noAvailable":"15","imageUrl":"http://books.toscrape.com/media/cache/86/38/8638ba095b3b32e0abdef170e7bc4fd6.jpg","bookDescription":"In the village of King's Abbot, a widow's sudden suicide sparks rumors that she murdered her first husband, was being blackmailed, and was carrying on a secret affair with the wealthy Roger Ackroyd. The following evening, Ackroyd is murdered in his locked study--but not before receiving a letter identifying the widow's blackmailer. King's Abbot is crawling with suspects, i In the village of King's Abbot, a widow's sudden suicide sparks rumors that she murdered her first husband, was being blackmailed, and was carrying on a secret affair with the wealthy Roger Ackroyd. The following evening, Ackroyd is murdered in his locked study--but not before receiving a letter identifying the widow's blackmailer. King's Abbot is crawling with suspects, including a nervous butler, Ackroyd's wayward stepson, and his sister-in-law, Mrs. Cecil Ackroyd, who has taken up residence in the victim's home. It's now up to the famous detective Hercule Poirot, who has retired to King's Abbot to garden, to solve the case of who killed Roger Ackroyd--a task in which he is aided by the village doctor and narrator, James Sheppard, and by Sheppard's ingenious sister, Caroline.The Murder of Roger Ackroyd is the book that made Agatha Christie a household name and launched her career as a perennial bestseller. Originally published in 1926, it is a landmark in the mystery genre. It was in the vanguard of a new class of popular detective fiction that ushered in the modern era of mystery novels. ...more","upc":"c7b5183f4d1d4efe"},{"bookTitle":"The Last Mile (Amos Decker #2)","bookPrice":"£54.21","noAvailable":"14","imageUrl":"http://books.toscrape.com/media/cache/e6/dc/e6dcc8f75214eb14edc1ce09c98f3d71.jpg","bookDescription":"In his #1 New York Times bestseller Memory Man, David Baldacci introduced the extraordinary detective Amos Decker-the man who can forget nothing. Now, Decker returns in a spectacular new thriller . . . THE LAST MILEConvicted murderer Melvin Mars is counting down the last hours before his execution--for the violent killing of his parents twenty years earlier--when he's gran In his #1 New York Times bestseller Memory Man, David Baldacci introduced the extraordinary detective Amos Decker-the man who can forget nothing. Now, Decker returns in a spectacular new thriller . . . THE LAST MILEConvicted murderer Melvin Mars is counting down the last hours before his execution--for the violent killing of his parents twenty years earlier--when he's granted an unexpected reprieve. Another man has confessed to the crime.Amos Decker, newly hired on an FBI special task force, takes an interest in Mars's case after discovering the striking similarities to his own life: Both men were talented football players with promising careers cut short by tragedy. Both men's families were brutally murdered. And in both cases, another suspect came forward, years after the killing, to confess to the crime. A suspect who may or may not have been telling the truth.The confession has the potential to make Melvin Mars--guilty or not--a free man. Who wants Mars out of prison? And why now?But when a member of Decker's team disappears, it becomes clear that something much larger--and more sinister--than just one convicted criminal's life hangs in the balance. Decker will need all of his extraordinary brainpower to stop an innocent man from being executed. ...more","upc":"3bc89353f7e3a3cc"},{"bookTitle":"That Darkness (Gardiner and Renner #1)","bookPrice":"£13.92","noAvailable":"14","imageUrl":"http://books.toscrape.com/media/cache/23/b8/23b81994234ac127d701db1531a08e48.jpg","bookDescription":"As a forensic investigator for the Cleveland Police Department, Maggie Gardiner has seen her share of Jane Does. The latest is an unidentified female in her early teens, discovered in a local cemetery. More shocking than the girl’s injuries—for Maggie at least—is the fact that no one has reported her missing. She and the detectives assigned to the case (including her cop e As a forensic investigator for the Cleveland Police Department, Maggie Gardiner has seen her share of Jane Does. The latest is an unidentified female in her early teens, discovered in a local cemetery. More shocking than the girl’s injuries—for Maggie at least—is the fact that no one has reported her missing. She and the detectives assigned to the case (including her cop ex-husband) are determined to follow every lead, run down every scrap of evidence. But the monster they seek is watching each move, closer to them than they could ever imagine. Jack Renner is a killer. He doesn’t murder because he savors it, or because he believes himself omnipotent, or for any reason other than to make the world a safer place. When he follows the trail of this Jane Doe to a locked room in a small apartment where eighteen teenaged girls are anything but safe, he knows something must be done. But his pursuit of their captor takes an unexpected turn.Maggie Gardiner finds another body waiting for her in the autopsy room—and a host of questions that will challenge everything she believes about justice, morality, and the true nature of evil … ...more","upc":"0c7b9cf2b7662b65"},{"bookTitle":"Tastes Like Fear (DI Marnie Rome #3)","bookPrice":"£10.69","noAvailable":"14","imageUrl":"http://books.toscrape.com/media/cache/74/9b/749bca168778cf35fdb2441a9d6b403f.jpg","bookDescription":"Sarah Hilary won the 2015 Theakston's Crime Novel of the Year with her debut, the 2014 Richard and Judy pick SOMEONE ELSE'S SKIN. She followed up with NO OTHER DARKNESS, proclaimed as 'riveting' by Lisa Gardner and 'truly mesmerising' by David Mark. Now D.I. Marnie Rome returns in her third novel.Home is where Harm lies...The young girl who causes the fatal car crash disap Sarah Hilary won the 2015 Theakston's Crime Novel of the Year with her debut, the 2014 Richard and Judy pick SOMEONE ELSE'S SKIN. She followed up with NO OTHER DARKNESS, proclaimed as 'riveting' by Lisa Gardner and 'truly mesmerising' by David Mark. Now D.I. Marnie Rome returns in her third novel.Home is where Harm lies...The young girl who causes the fatal car crash disappears from the scene.A runaway who doesn't want to be found, she only wants to go home.To the one man who understands her.Gives her shelter. Just as he gives shelter to the other lost girls who live in his house.He's the head of her new family.He's Harm. And when Harm's family is threatened, Marnie Rome is about to find out that everything tastes like fear... ...more","upc":"2d1e337aaf341858"},{"bookTitle":"A Time of Torment (Charlie Parker #14)","bookPrice":"£48.35","noAvailable":"14","imageUrl":"http://books.toscrape.com/media/cache/f1/37/f137a410ed7d6fcfce17d081caf97915.jpg","bookDescription":"Jerome Burnel was once a hero. He intervened to prevent multiple killings and in doing so damned himself. His life was torn apart. He was imprisoned, brutalized.But in his final days, with the hunters circling, he tells his story to private detective Charlie Parker. He speaks of the girl who was marked for death but was saved, of the ones who tormented him, and an entity t Jerome Burnel was once a hero. He intervened to prevent multiple killings and in doing so damned himself. His life was torn apart. He was imprisoned, brutalized.But in his final days, with the hunters circling, he tells his story to private detective Charlie Parker. He speaks of the girl who was marked for death but was saved, of the ones who tormented him, and an entity that hides in a ruined stockade.Parker is not like other men. He died, and was reborn. He is ready to wage war.Now he will descend upon a strange, isolated community called the Cut, and face down a force of men who rule by terror, intimidation, and murder.All in the name of the being they serve.All in the name of the Dead King. ...more","upc":"4416c474713ec1f5"},{"bookTitle":"A Study in Scarlet (Sherlock Holmes #1)","bookPrice":"£16.73","noAvailable":"14","imageUrl":"http://books.toscrape.com/media/cache/27/40/274003f2720f82844873945b87af6c19.jpg","bookDescription":"In the debut of literature's most famous sleuth, a dead man is discovered in a bloodstained room in Brixton. The only clues are a wedding ring, a gold watch, a pocket edition of Boccaccio's Decameron, and a word scrawled in blood on the wall. With this investigation begins the partnership of Sherlock Holmes and Dr. Watson. Their search for the murderer uncovers a story of In the debut of literature's most famous sleuth, a dead man is discovered in a bloodstained room in Brixton. The only clues are a wedding ring, a gold watch, a pocket edition of Boccaccio's Decameron, and a word scrawled in blood on the wall. With this investigation begins the partnership of Sherlock Holmes and Dr. Watson. Their search for the murderer uncovers a story of love and revenge-and heralds a franchise of detective mysteries starring the formidable Holmes. ...more","upc":"63ee5bc46066a8a8"},{"bookTitle":"Poisonous (Max Revere Novels #3)","bookPrice":"£26.80","noAvailable":"12","imageUrl":"http://books.toscrape.com/media/cache/8d/52/8d52227d29e03695ef755620078b7815.jpg","bookDescription":"Teen-aged Internet bully Ivy Lake fell off a cliff and few people cared ... except her mentally-challenged eighteen-year-old step-brother, Tommy. He loved her in spite of her cruelty. He's distraught and doesn't understand why his blended family is falling apart. After a year, the police still have no answers: Ivy could have jumped, could have been pushed, or it could have Teen-aged Internet bully Ivy Lake fell off a cliff and few people cared ... except her mentally-challenged eighteen-year-old step-brother, Tommy. He loved her in spite of her cruelty. He's distraught and doesn't understand why his blended family is falling apart. After a year, the police still have no answers: Ivy could have jumped, could have been pushed, or it could have been an accident. With too many suspects and not enough evidence, the investigation has grown cold.Tommy thinks that if someone can figure out what happened to his step-sister, everything will go back to normal, so he writes to investigative reporter Maxine Revere. This isn’t the type of case Max normally takes on, but the heartbreak and simple honesty in Tommy's letter pulls her in. She travels to Corte Madera, California, with her assistant David Kane and is at first pleased that the police are cooperative. But the more Max learns about Tommy and his dysfunctional family, the more she thinks she’s taken on an impossible task: this may be the one case she can’t solve.If Ivy was murdered, it was exceptionally well-planned and that kind of killer could be hiding in plain sight ... planning the next act of violence. Max believes the truth is always better than lies, that the truth is the only thing that matters to gain justice for victims and their families. But for the first time, she wonders if this time, the truth will kill. ...more","upc":"abdd91e96515a617"},{"bookTitle":"Murder at the 42nd Street Library (Raymond Ambler #1)","bookPrice":"£54.36","noAvailable":"12","imageUrl":"http://books.toscrape.com/media/cache/19/74/19748437aac103dbdeb1918062728726.jpg","bookDescription":"Murder at the 42nd Street Library opens with a murder in a second floor office of the iconic, beaux-arts flagship of the New York Public Library. Ray Ambler, the curator of the library's crime fiction collection, joins forces with NYPD homicide detective Mike Cosgrove in hopes of bringing a murderer to justice.In his search for the reasons behind the murder, Ambler uncover Murder at the 42nd Street Library opens with a murder in a second floor office of the iconic, beaux-arts flagship of the New York Public Library. Ray Ambler, the curator of the library's crime fiction collection, joins forces with NYPD homicide detective Mike Cosgrove in hopes of bringing a murderer to justice.In his search for the reasons behind the murder, Ambler uncovers hidden--and profoundly disturbing--relationships between visitors to the library. These include a celebrated mystery writer who has donated his papers to the library's crime fiction collection, that writer's missing daughter, a New York society woman with a hidden past, and one of Ambler's colleagues at the world-famous library. Those shocking revelations lead inexorably to the tragic and violent events that follow. ...more","upc":"e7fe3bf2768602cf"},{"bookTitle":"Most Wanted","bookPrice":"£35.28","noAvailable":"12","imageUrl":"http://books.toscrape.com/media/cache/fa/b5/fab5e650b19b76c5f5d1ce3a626376b1.jpg","bookDescription":"Lisa Scottoline delivers another searing, powerful blockbuster novel that explores hot-button issues within the framework of an intricately plotted thriller. When a woman and her husband, desperate for a baby, find themselves unable to conceive, they decide to take further steps. Since it is the husband who is infertile, the heroine decides to use a donor. And all seems to Lisa Scottoline delivers another searing, powerful blockbuster novel that explores hot-button issues within the framework of an intricately plotted thriller. When a woman and her husband, desperate for a baby, find themselves unable to conceive, they decide to take further steps. Since it is the husband who is infertile, the heroine decides to use a donor. And all seems to be well. Three months pass and she is happily pregnant. But a shocking revelation occurs when she discovers that a man arrested for a series of brutal murders is her donor - the biological father of the child she is carrying. Delving deeper to uncover the truth, the heroine must face her worst fears, and confront a terrifying truth. Most Wanted is sure to be Lisa Scottoline's most discussed, bestselling novel yet. ...more","upc":"c039f5aceb093537"},{"bookTitle":"Hide Away (Eve Duncan #20)","bookPrice":"£11.84","noAvailable":"12","imageUrl":"http://books.toscrape.com/media/cache/b2/c5/b2c501b848bccd9cc375771f53c0fb6e.jpg","bookDescription":"Iris Johansen's beloved forensic sculptor Eve Duncan is back and now the stakes are higher than ever. Dramatic changes are on the horizon for Eve and Joe Quinn and their relationship may never be the same. Faced with the task of protecting Cara Delaney, a young girl with ruthless enemies who want to see her dead, Eve takes her away to the remote Scottish Highlands where th Iris Johansen's beloved forensic sculptor Eve Duncan is back and now the stakes are higher than ever. Dramatic changes are on the horizon for Eve and Joe Quinn and their relationship may never be the same. Faced with the task of protecting Cara Delaney, a young girl with ruthless enemies who want to see her dead, Eve takes her away to the remote Scottish Highlands where they join Jane MacGuire in search of a hidden treasure. But nowhere is far enough away to protect Cara from danger. With enemies closing in from all sides, Hide Away is a high-octane thriller that fans will not want to miss. ...more","upc":"bddc6fd036eb6279"},{"bookTitle":"Boar Island (Anna Pigeon #19)","bookPrice":"£59.48","noAvailable":"12","imageUrl":"http://books.toscrape.com/media/cache/91/8c/918c2c95ae90495cdb0371a22b726d82.jpg","bookDescription":"Bringing you a gripping mystery, Nevada Barr transports you to the wild and dangerous landscapes of America's National Parks and is sure to appeal if you like Sue Grafton and Janet Evanovich.The eighteenth sensational crime novel from New York Times bestselling author Nevada Barr featuring fearless park ranger Anna Pigeon as she battles to solve a heinous crime set amidst Bringing you a gripping mystery, Nevada Barr transports you to the wild and dangerous landscapes of America's National Parks and is sure to appeal if you like Sue Grafton and Janet Evanovich.The eighteenth sensational crime novel from New York Times bestselling author Nevada Barr featuring fearless park ranger Anna Pigeon as she battles to solve a heinous crime set amidst the wild and dangerous landscape of a US National Park. ...more","upc":"49b24c6a41b82bd2"},{"bookTitle":"The Widow","bookPrice":"£27.26","noAvailable":"11","imageUrl":"http://books.toscrape.com/media/cache/e4/37/e43737572b04c7ad28b35f3da29eb8dd.jpg","bookDescription":"THE NEW YORK TIMESBESTSELLERFor fans of Gone Girl and The Girl on the Train, an electrifying thriller that will take you into the dark spaces that exist between a husband and a wife.When the police started asking questions, Jean Taylor turned into a different woman. One who enabled her and her husband to carry on, when more bad things began to happen... But that woman’s h THE NEW YORK TIMES BESTSELLERFor fans of Gone Girl and The Girl on the Train, an electrifying thriller that will take you into the dark spaces that exist between a husband and a wife.When the police started asking questions, Jean Taylor turned into a different woman. One who enabled her and her husband to carry on, when more bad things began to happen...   But that woman’s husband died last week. And Jean doesn’t have to be her anymore.   There’s a lot Jean hasn’t said over the years about the crime her husband was suspected of committing. She was too busy being the perfect wife, standing by her man while living with the accusing glares and the anonymous harassment.   Now there’s no reason to stay quiet. There are people who want to hear her story. They want to know what it was like living with that man. She can tell them that there were secrets. There always are in a marriage.   The truth—that’s all anyone wants. But the one lesson Jean has learned in the last few years is that she can make people believe anything… ...more","upc":"6159d8b187831770"},{"bookTitle":"Playing with Fire","bookPrice":"£13.71","noAvailable":"11","imageUrl":"http://books.toscrape.com/media/cache/09/02/0902666ade8ab8183363e53c108e5069.jpg","bookDescription":"A beautiful violinist is haunted by a very old piece of music she finds in a strange antique shop in Rome.The first time Julia Ansdell picks up The Incendio Waltz, she knows it’s a strikingly unusual composition. But while playing the piece, Julia blacks out and awakens to find her young daughter implicated in acts of surprising violence. And when she travels to Venice to A beautiful violinist is haunted by a very old piece of music she finds in a strange antique shop in Rome.The first time Julia Ansdell picks up The Incendio Waltz, she knows it’s a strikingly unusual composition. But while playing the piece, Julia blacks out and awakens to find her young daughter implicated in acts of surprising violence. And when she travels to Venice to find the previous owner of the music, she uncovers a dark secret that involves dangerously powerful people—a family who would stop at nothing to keep Julia from bringing the truth to light. ...more","upc":"05a61a3bd8ca4149"},{"bookTitle":"What Happened on Beale Street (Secrets of the South Mysteries #2)","bookPrice":"£25.37","noAvailable":"7","imageUrl":"http://books.toscrape.com/media/cache/2c/68/2c6857eb1c10995c8b9e77a1804f68cd.jpg","bookDescription":"What Happened on Beale Street is an exciting addition to the Secrets of the South Mysteries from bestselling author Mary Ellis. These standalone, complex crime dramas follow a private investigator's quest to make the world a better place...solving one case at a time.A cryptic plea for help from a childhood friend sends cousins Nate and Nicki Price from New Orleans to Memph What Happened on Beale Street is an exciting addition to the Secrets of the South Mysteries from bestselling author Mary Ellis. These standalone, complex crime dramas follow a private investigator's quest to make the world a better place...solving one case at a time.A cryptic plea for help from a childhood friend sends cousins Nate and Nicki Price from New Orleans to Memphis, the home of scrumptious barbecue and soulful blues music. When they arrive at Danny Andre's last known address, they discover signs of a struggle and a lifestyle not in keeping with the former choirboy they fondly remember.Danny's sister, Isabelle, reluctantly accepts their help. She and Nate aren't on the best of terms due to a complicated past, yet they will have to get beyond that if they want to save Danny.On top of Danny's alarming disappearance and his troubled relationship with Isabelle, Nate also has to rein in his favorite cousin's overzealousness as a new and eager PI. Confronted with a possible murder, mystery, and mayhem in the land of the Delta blues, Nate must rely on his faith and investigative experience to keep one or more of them from getting killed. ...more","upc":"9735c969c652dd89"},{"bookTitle":"The Bachelor Girl's Guide to Murder (Herringford and Watts Mysteries #1)","bookPrice":"£52.30","noAvailable":"7","imageUrl":"http://books.toscrape.com/media/cache/38/a4/38a44ac4f642f4717d865c81ec594529.jpg","bookDescription":"In 1910 Toronto, while other bachelor girls perfect their domestic skills and find husbands, two friends perfect their sleuthing skills and find a murderer.Inspired by their fascination with all things Sherlock Holmes, best friends and flatmates Merinda and Jem launch a consulting detective business. The deaths of young Irish women lead Merinda and Jem deeper into the mire In 1910 Toronto, while other bachelor girls perfect their domestic skills and find husbands, two friends perfect their sleuthing skills and find a murderer.Inspired by their fascination with all things Sherlock Holmes, best friends and flatmates Merinda and Jem launch a consulting detective business. The deaths of young Irish women lead Merinda and Jem deeper into the mire of the city's underbelly, where the high hopes of those dreaming to make a new life in Canada are met with prejudice and squalor.While searching for answers, donning disguises, and sneaking around where no proper ladies would ever go, they pair with Jasper Forth, a police constable, and Ray DeLuca, a reporter in whom Jem takes a more than professional interest. Merinda could well be Toronto's premiere consulting detective, and Jem may just find a way to put her bachelor girlhood behind her forever--if they can stay alive long enough to do so. ...more","upc":"20789fb17b423c4c"},{"bookTitle":"Delivering the Truth (Quaker Midwife Mystery #1)","bookPrice":"£20.89","noAvailable":"7","imageUrl":"http://books.toscrape.com/media/cache/5c/8a/5c8acde540a88aed464ab5c52bafcd83.jpg","bookDescription":"Quaker midwife Rose Carroll hears secrets and keeps confidences as she attends births of the rich and poor alike in an 1888 Massachusetts mill town. When the town’s world-famed carriage industry is threatened by the work of an arsonist, and a carriage factory owner’s adult son is stabbed to death with Rose's own knitting needle, she is drawn into solving the mystery. Thing Quaker midwife Rose Carroll hears secrets and keeps con­fi­dences as she attends births of the rich and poor alike in an 1888 Massachusetts mill town. When the town’s world-famed car­riage indus­try is threat­ened by the work of an arson­ist, and a car­riage fac­tory owner’s adult son is stabbed to death with Rose's own knitting needle, she is drawn into solv­ing the mys­tery. Things get dicey after the same owner’s mis­tress is also mur­dered, leav­ing her one-week-old baby with­out a mother. The Quaker poet and abolitionist John Greenleaf Whittier helps Rose by lending words of advice and support. While strug­gling with being less than the per­fect Friend, Rose draws on her strengths as a counselor and prob­lem solver to bring two mur­der­ers to justice before they destroy the town’s carriage industry and the people who run it. ...more","upc":"4e980425468708da"},{"bookTitle":"The Mysterious Affair at Styles (Hercule Poirot #1)","bookPrice":"£24.80","noAvailable":"6","imageUrl":"http://books.toscrape.com/media/cache/6b/61/6b61d393f0731f6c52182ba3cf41e245.jpg","bookDescription":"Poirot, a Belgian refugee of the Great War, is settling in England near the home of Emily Inglethorp, who helped him to his new life. His friend Hastings arrives as a guest at her home. When the woman is killed, Poirot uses his detective skills to solve the mystery.","upc":"2da5edf8b5776c9a"},{"bookTitle":"In the Woods (Dublin Murder Squad #1)","bookPrice":"£38.38","noAvailable":"6","imageUrl":"http://books.toscrape.com/media/cache/13/47/13470484ded8c835ce03b662fc863a1a.jpg","bookDescription":"A gorgeously written novel that marks the debut of an astonishing new voice in psychological suspense.As dusk approaches a small Dublin suburb in the summer of 1984, mothers begin to call their children home. But on this warm evening, three children do not return from the dark and silent woods. When the police arrive, they find only one of the children. He is gripping a tr A gorgeously written novel that marks the debut of an astonishing new voice in psychological suspense.As dusk approaches a small Dublin suburb in the summer of 1984, mothers begin to call their children home. But on this warm evening, three children do not return from the dark and silent woods. When the police arrive, they find only one of the children. He is gripping a tree trunk in terror, wearing blood-filled sneakers and unable to recall a single detail of the previous hours.Twenty years later, the found boy, Rob Ryan, is a detective on the Dublin Murder Squad and keeps his past a secret. But when a 12-year-old girl is found murdered in the same woods, he and Detective Cassie Maddox (his partner and closest friend) find themselves investigating a case chillingly similar to the previous unsolved mystery. Now, with only snippets of long-buried memories to guide him, Ryan has the chance to uncover both the mystery of the case before him and that of his own shadowy past. ...more","upc":"6958de044cb28a84"},{"bookTitle":"The Silkworm (Cormoran Strike #2)","bookPrice":"£23.05","noAvailable":"3","imageUrl":"http://books.toscrape.com/media/cache/fa/d2/fad227281b25d606782218a33323991b.jpg","bookDescription":"Private investigator Cormoran Strike returns in a new mystery from Robert Galbraith, author of the #1 international bestseller The Cuckoo's Calling.When novelist Owen Quine goes missing, his wife calls in private detective Cormoran Strike. At first, Mrs. Quine just thinks her husband has gone off by himself for a few days—as he has done before—and she wants Strike to find Private investigator Cormoran Strike returns in a new mystery from Robert Galbraith, author of the #1 international bestseller The Cuckoo's Calling.When novelist Owen Quine goes missing, his wife calls in private detective Cormoran Strike. At first, Mrs. Quine just thinks her husband has gone off by himself for a few days—as he has done before—and she wants Strike to find him and bring him home.But as Strike investigates, it becomes clear that there is more to Quine's disappearance than his wife realizes. The novelist has just completed a manuscript featuring poisonous pen-portraits of almost everyone he knows. If the novel were to be published, it would ruin lives—meaning that there are a lot of people who might want him silenced.When Quine is found brutally murdered under bizarre circumstances, it becomes a race against time to understand the motivation of a ruthless killer, a killer unlike any Strike has encountered before... ...more","upc":"f06039c29b5891fa"},{"bookTitle":"The Exiled","bookPrice":"£43.45","noAvailable":"3","imageUrl":"http://books.toscrape.com/media/cache/dd/29/dd29147b962e4480491cac5bce41e4e4.jpg","bookDescription":"Can anyone ever truly outrun his past?Back in the 1980s, Wes Raney was an ambitious New York City Narcotics Detective with a growing drug habit of his own. While working undercover on a high-risk case, he made decisions that ultimately cost him not only his career, but also his family. Disgraced, Raney fled-but history is finally catching up with him.Now in his early forti Can anyone ever truly outrun his past?Back in the 1980s, Wes Raney was an ambitious New York City Narcotics Detective with a growing drug habit of his own. While working undercover on a high-risk case, he made decisions that ultimately cost him not only his career, but also his family. Disgraced, Raney fled-but history is finally catching up with him.Now in his early forties, Raney has been living in exile, the sole homicide investigator covering a two-hundred-mile stretch of desert in New Mexico. His solitude is his salvation-but it ends when a brutal drug deal gone wrong results in a triple murder. Staged in a locked underground bunker, the crime reawakens Raney's haunted and violent past.From the vast, unforgiving landscape of the American west to the mean streets of New York, The Exiled is at once a riveting murder mystery and a brilliant portrait of a man on the run from himself, an unforgettable thriller that is \"impossible to put down\" (Frank Bill). ...more","upc":"dd003e904727281a"},{"bookTitle":"The Cuckoo's Calling (Cormoran Strike #1)","bookPrice":"£19.21","noAvailable":"3","imageUrl":"http://books.toscrape.com/media/cache/72/ec/72ec24f082aba608ca37bc3aeaf57317.jpg","bookDescription":"A BRILLIANT DEBUT MYSTERY IN A CLASSIC VEIN: DETECTIVE CORMORAN STRIKE INVESTIGATES A SUPERMODEL'S SUICIDE. After losing his leg to a land mine in Afghanistan, Cormoran Strike is barely scraping by as a private investigator. Strike is down to one client, and creditors are calling. He has also just broken up with his longtime girlfriend and is living in his office.Then John A BRILLIANT DEBUT MYSTERY IN A CLASSIC VEIN: DETECTIVE CORMORAN STRIKE INVESTIGATES A SUPERMODEL'S SUICIDE. After losing his leg to a land mine in Afghanistan, Cormoran Strike is barely scraping by as a private investigator. Strike is down to one client, and creditors are calling. He has also just broken up with his longtime girlfriend and is living in his office.Then John Bristow walks through his door with an amazing story: His sister, the legendary supermodel Lula Landry, known to her friends as the Cuckoo, famously fell to her death a few months earlier. The police ruled it a suicide, but John refuses to believe that. The case plunges Strike into the world of multimillionaire beauties, rock-star boyfriends, and desperate designers, and it introduces him to every variety of pleasure, enticement, seduction, and delusion known to man.You may think you know detectives, but you've never met one quite like Strike. You may think you know about the wealthy and famous, but you've never seen them under an investigation like this. Introducing Cormoran Strike, this is the acclaimed first crime novel by J.K. Rowling, writing under the pseudonym Robert Galbraith. ...more","upc":"1be6d3b121865edb"},{"bookTitle":"Extreme Prey (Lucas Davenport #26)","bookPrice":"£25.40","noAvailable":"3","imageUrl":"http://books.toscrape.com/media/cache/0a/b2/0ab24d35793497f6a72137191b91659e.jpg","bookDescription":"The extraordinary new Lucas Davenport thriller from #1New York Times–bestselling author and Pulitzer Prize winner John Sandford. After the events in Gathering Prey, Lucas Davenport finds himself in a very unusual situation—no longer employed by the Minnesota BCA. His friend the governor is just cranking up a presidential campaign, though, and he invites Lucas to come alon The extraordinary new Lucas Davenport thriller from #1 New York Times–bestselling author and Pulitzer Prize winner John Sandford.   After the events in Gathering Prey, Lucas Davenport finds himself in a very unusual situation—no longer employed by the Minnesota BCA. His friend the governor is just cranking up a presidential campaign, though, and he invites Lucas to come along as part of his campaign staff. “Should be fun!” he says, and it kind of is—until they find they have a shadow: an armed man intent on killing the governor . . . and anyone who gets in the way. ...more","upc":"588ba85ff11a3263"},{"bookTitle":"Career of Evil (Cormoran Strike #3)","bookPrice":"£24.72","noAvailable":"3","imageUrl":"http://books.toscrape.com/media/cache/40/f8/40f897ffbfda6e88e5763c157cfd0930.jpg","bookDescription":"Cormoran Strike is back, with his assistant Robin Ellacott, in a mystery based around soldiers returning from war.When a mysterious package is delivered to Robin Ellacott, she is horrified to discover that it contains a woman’s severed leg.Her boss, private detective Cormoran Strike, is less surprised but no less alarmed. There are four people from his past who he thinks c Cormoran Strike is back, with his assistant Robin Ellacott, in a mystery based around soldiers returning from war.When a mysterious package is delivered to Robin Ellacott, she is horrified to discover that it contains a woman’s severed leg.Her boss, private detective Cormoran Strike, is less surprised but no less alarmed. There are four people from his past who he thinks could be responsible – and Strike knows that any one of them is capable of sustained and unspeakable brutality.With the police focusing on the one suspect Strike is increasingly sure is not the perpetrator, he and Robin take matters into their own hands, and delve into the dark and twisted worlds of the other three men. But as more horrendous acts occur, time is running out for the two of them…Career of Evil is the third in the series featuring private detective Cormoran Strike and his assistant Robin Ellacott. A mystery and also a story of a man and a woman at a crossroads in their personal and professional lives. ...more","upc":"b461cf238506c5b8"},{"bookTitle":"The No. 1 Ladies' Detective Agency (No. 1 Ladies' Detective Agency #1)","bookPrice":"£57.70","noAvailable":"1","imageUrl":"http://books.toscrape.com/media/cache/62/8c/628c0151226402726149c98549671250.jpg","bookDescription":"The No.1 ladies' detective agency consists of one woman, the engaging and sassy Precious Ramotswe, who sets up shop in Gabarone, Botswana. This unlikely herione specialises in missing husbands, wayward daughters, con men and impostors.","upc":"b0913e67d38d5ed5"},{"bookTitle":"The Girl You Lost","bookPrice":"£12.29","noAvailable":"1","imageUrl":"http://books.toscrape.com/media/cache/28/15/2815974db428ea019fc84e08af23095b.jpg","bookDescription":"Eighteen years ago your baby daughter was snatched. Today, she came back. A sinister and darkly compelling psychological thriller from the No.1 bestselling author of The Girl With No Past. Eighteen years ago, Simone Porter’s six-month-old daughter, Helena, was abducted. Simone and husband, Matt, have slowly rebuilt their shattered lives, but the pain at losing their child Eighteen years ago your baby daughter was snatched. Today, she came back. A sinister and darkly compelling psychological thriller from the No.1 bestselling author of The Girl With No Past. Eighteen years ago, Simone Porter’s six-month-old daughter, Helena, was abducted. Simone and husband, Matt, have slowly rebuilt their shattered lives, but the pain at losing their child has never left them. Then a young woman, Grace, appears out of the blue and tells Simone she has information about her stolen baby. But just who is Grace – and can Simone trust her? When Grace herself disappears, Simone becomes embroiled in a desperate search for her daughter and the woman who has vital clues about her whereabouts. Simone is inching closer to the truth but it’ll take her into dangerous and disturbing territory. Simone lost her baby. Will she lose her life trying to find her? Read what people are saying about the Number One Bestseller, The Girl With No Past: ‘I read this in a day and found myself totally engaged with the plot. Kathryn Croft has pulled off a very accessible mystery, that exceeded my expectations and shows her talent. The ending was just right! Worth a read if you fancy a well paced mystery, on these dark autumnal nights.’ Northern Crime ‘Kept the tension and mystery going right until the end … An intense read that keeps you turning page after page.’ Crime Book Club ‘Wow! This book grabbed me from the very beginning! … To say this book is a page turner would be an understatement!’ Chat About Books ‘It kept me up all night and cost me my beauty sleep! I will get it out of the way immediately and tell you that this is one of the best thrillers I have read this year and it is fully deserving of my 5-star rating.’ Books Are Man’s Other Best Friend ‘BLIMEY. This book is GRIPPY - I sat and read it over the course of a day and a night, purely because I couldn't put it down.’ Reading Room with a View ‘The reader is kept guessing until the end. It's perfection for a thriller and the author does amazingly to keep our intrigue.’ Chic Toronto ‘Gripping, a real page turner… Excellent plot, and gripping stuff, that keeps the reader guessing until the end … raced to the end to find out what was happening and how it would all end … what a storyteller Kathryn Croft is!’ Emma’s Book Reviews ‘The concept of this book, and the story itself is phenomenal - honestly one of the best i have read, it really does outshine all other thrillers i have read.’ Afternoon Bookery ‘I really enjoyed this from start to finish. It's one of these books where you just HAVE to read JUST a couple more pages to see what is going to happen next. The author is very good at building suspense and revealing details bit by bit. It was totally unpredictable and had some very good twists. ...more","upc":"4280ac3eab57aa5d"},{"bookTitle":"The Girl In The Ice (DCI Erika Foster #1)","bookPrice":"£15.85","noAvailable":"1","imageUrl":"http://books.toscrape.com/media/cache/83/54/835421d17d99c89fd99d07e17806357b.jpg","bookDescription":"Her eyes are wide open. Her lips parted as if to speak. Her dead body frozen in the ice…She is not the only one. When a young boy discovers the body of a woman beneath a thick sheet of ice in a South London park, Detective Erika Foster is called in to lead the murder investigation. The victim, a beautiful young socialite, appeared to have the perfect life. Yet when Erika b Her eyes are wide open. Her lips parted as if to speak. Her dead body frozen in the ice…She is not the only one. When a young boy discovers the body of a woman beneath a thick sheet of ice in a South London park, Detective Erika Foster is called in to lead the murder investigation. The victim, a beautiful young socialite, appeared to have the perfect life. Yet when Erika begins to dig deeper, she starts to connect the dots between the murder and the killings of three prostitutes, all found strangled, hands bound and dumped in water around London. What dark secrets is the girl in the ice hiding? As Erika inches closer to uncovering the truth, the killer is closing in on Erika. The last investigation Erika led went badly wrong… resulting in the death of her husband. With her career hanging by a thread, Erika must now battle her own personal demons as well as a killer more deadly than any she’s faced before. But will she get to him before he strikes again?A page-turning thriller packed with suspense. If you like Angela Marsons, Rachel Abbott and Karin Slaughter, discover Rob Bryndza’s new series today – at a special launch price. Watch out for more from DCI Erika FosterShe’s fearless. Respected. Unstoppable. Detective Erika Foster will catch a killer, whatever it takes. 1. THE GIRL IN THE ICE 2. THE NIGHT STALKER (COMING SOON) ...more","upc":"ee61197edb882599"},{"bookTitle":"Blood Defense (Samantha Brinkman #1)","bookPrice":"£20.30","noAvailable":"1","imageUrl":"http://books.toscrape.com/media/cache/ea/12/ea12c82131832c5d772fdbd3cb56ced7.jpg","bookDescription":"First in a new series from bestselling author and famed O. J. Simpson trial prosecutor Marcia Clark, a “terrific writer and storyteller” (James Patterson). Samantha Brinkman, an ambitious, hard-charging Los Angeles criminal defense attorney, is struggling to make a name for herself and to drag her fledgling practice into the big leagues. Sam lands a high-profile double-mu First in a new series from bestselling author and famed O. J. Simpson trial prosecutor Marcia Clark, a “terrific writer and storyteller” (James Patterson). Samantha Brinkman, an ambitious, hard-charging Los Angeles criminal defense attorney, is struggling to make a name for herself and to drag her fledgling practice into the big leagues. Sam lands a high-profile double-murder case in which one of the victims is a beloved TV star—and the defendant is a decorated veteran LAPD detective. It promises to be exactly the kind of media sensation that would establish her as a heavy hitter in the world of criminal law.Though Sam has doubts about his innocence, she and her two associates (her closest childhood friend and a brilliant ex-con) take the case. Notorious for living by her own rules—and fearlessly breaking everyone else’s—Samantha pulls out all the stops in her quest to uncover evidence that will clear the detective. But when a shocking secret at the core of the case shatters her personal world, Sam realizes that not only has her client been playing her, he might be one of the most dangerous sociopaths she’s ever encountered. ...more","upc":"95cdfd514098c38b"},{"bookTitle":"1st to Die (Women's Murder Club #1)","bookPrice":"£53.98","noAvailable":"1","imageUrl":"http://books.toscrape.com/media/cache/f6/8e/f68e6ae2f9da04fccbde8442b0a1b52a.jpg","bookDescription":"James Patterson, bestselling author of the Alex Cross novels Along Came a Spider, Kiss the Girls, and Pop Goes the Weasel, offers the first of a new series dubbed The Women's Murder Club, featuring a four-woman team that occasionally works outside the system. None of the gritty darkness or frenzied action is lost in 1st to Die, although the female protagonists offer an eve James Patterson, bestselling author of the Alex Cross novels Along Came a Spider, Kiss the Girls, and Pop Goes the Weasel, offers the first of a new series dubbed The Women's Murder Club, featuring a four-woman team that occasionally works outside the system. None of the gritty darkness or frenzied action is lost in 1st to Die, although the female protagonists offer an even deeper emotional context to this suspense thriller.Inspector Lindsay Boxer of the San Francisco Police Department suddenly finds herself in the middle of two horrifying situations: The first is that she's just learned she has an often-fatal blood disease. The second is a double homicide case she is now heading up that involves the murder of newlyweds on their wedding night. Burdened with Chris Raleigh, a new partner reassigned from the mayor's office, Lindsay finds that she has too much to deal with and turns to her best friend, Claire, the head ME on the case. Claire offers helpful advice and human, friendly contact amid a job filled with violence, cruelty, and fear.Soon a fledgling newspaper reporter, Cindy, makes contact with Lindsay looking for a career-making story. Although Lindsay can't officially comment on the case, the two women form a rapport, and Cindy joins Lindsay and Claire for their weekly meeting. When a second pair of newlyweds is murdered, and later a third, the investigation leads to a prominent crime writer, Nicholas Jenks, who has a history of spousal abuse and a predilection for kinky, dangerous sex games. With the help of an understanding assistant D.A., Jill Bernhardt, Lindsay tries to make a case against Jenks, who even had an affair with one of the slain women. Eventually Jill joins the Murder Club, and the four ladies share private interdepartmental information in an effort to track and stop the killer before he strikes again.The major subplot -- Lindsay's facing up to her illness even while she learns to fall in love again -- carefully compensates for the novel's coarse scenes of brutality. Lindsay Boxer is't merely an obsessed cop trailing a maniac; she's also a terrified woman confronting the onslaught of disease. The story lines balance out to show us the true mettle of someone who puts the safety of others before her own.Again, Patterson's skill for producing furiously paced fiction are evident as the novel breezes by rapidly. The short chapters keep the narrative leaping with increasingly taut plot elements, but there's an emotional commitment that makes our protagonist even more amiable and involving. 1st to Die is a novel that works as an intense series of character portraits that will leave the reader touched and delighted.--Tom Piccirilli ...more","upc":"f684a82adc49f011"}]}